{
  "S01E01": {
    "title": "Matka a dcera",
    "plot": "Rory je přijata na Chilton, ale jelikož Lorelai nemá na školné, požádá své bohaté rodiče. Ti ji vyhoví, ale na oplátku musí chodit každý pátek k nim na večeři. Rory se poprvé setkává s Deanem.",
    "thumb": "https://image.tmdb.org/t/p/w500/5ynO4Gc0ZpgmuhUuZKdeklV9cRh.jpg"
  },
  "S01E02": {
    "title": "První den v Chiltonu",
    "plot": "Lorelai zaspí první Roryin den na Chiltonu. Do ředitelny sice dorazí, ale v dost nevhodném oblečení. Poprvé se tu setkává s arogantní Paris a třídním krasavcem Tristanem.",
    "thumb": "https://image.tmdb.org/t/p/w500/81J05l77USnvcroRpoSlYQGpeAL.jpg"
  },
  "S01E03": {
    "title": "Zab mě",
    "plot": "Richard bere Rory na golf a přitom se sblíží, což se moc nelíbí Lorelai. Ta má ovšem na starost svatbu dvojčat a jejich matku.",
    "thumb": "https://image.tmdb.org/t/p/w500/7FbhaqpND8kTzcWbLKeWnKjpuO7.jpg"
  },
  "S01E04": {
    "title": "Lovci jelenů",
    "plot": "Rory čeká velký test ze Shakespeara a tak se učí celý víkend. V ten \"osudný\" den však zaspí a do hodiny přijde pozdě načež ji její profesor Max Medina sdělí, že už test psát nemůže. Suki se snaží přesvědčit kritika, že její jídlo není jen \"dobré\".",
    "thumb": "https://image.tmdb.org/t/p/w500/8eZPNvykbTRpsk3mVahDK197kOS.jpg"
  },
  "S01E05": {
    "title": "Pohřební hostina",
    "plot": "Babettina a Moreyho kočka Cinnamon zemře a tak se v jejich domě pořádá pohřební hostina. Max pozve Lorelai na večeři - ta souhlasí, ale Rory je proti. Mezi Rory a Deanem to jiskří stále více.",
    "thumb": "https://image.tmdb.org/t/p/w500/s83uaaURkAT73lVD8zX1G7hnzgc.jpg"
  },
  "S01E06": {
    "title": "Narozeninové večírky pro Rory",
    "plot": "Rory bude mít šestnácté narozeniny a tak ji Emily i Lorelai uspořádají večírky. Emily pozve své známé a Roryiny spolužáky, což se ji samořejmě vůbec nelíbí. Na večírek, který uspořádala Lorelai přijde i Emily s Richardem. Od Deana dostane náramek s medailonkem.",
    "thumb": "https://image.tmdb.org/t/p/w500/aBFo02qlm1tpD3OdpEW98OfUNm0.jpg"
  },
  "S01E07": {
    "title": "Utajený polibek",
    "plot": "Rory dostane od Deana svůj první polibek. Vše běží říct Lane, ale jejich rozhovor zaslechne Lanenina matka a vše řekne Lorelai. Lorelai je naštvaná, že ji Rory nic neřekla, a tak se snaží různým popichováním donutit Rory, aby ji o své prvním polibku řekla sama.",
    "thumb": "https://image.tmdb.org/t/p/w500/so9wkkV8l6qQbfrlcNRwAsxxTWD.jpg"
  },
  "S01E08": {
    "title": "Láska, válka a sníh",
    "plot": "Lorelai potká Maxe, který se snaží opravit své auto. Jelikož se mu to nepovede jde se projít s Lorelai. Rory uvízla kvůli sněhu u prarodičů. Když se ráno vrací domů, vidí na pohovce spícího Maxe a ve svém pokoji naštvanou Lane.",
    "thumb": "https://image.tmdb.org/t/p/w500/iKHhRkUFK5LZIZyLlK0JJqeBxYQ.jpg"
  },
  "S01E09": {
    "title": "Roryin ples",
    "plot": "Rory se chystá jít na večírek. Požádá Deana, jestli by šel s ní. Dean, i když tyto akce nemá příliš v lásce, souhlasí. Na večírku se oba nudí, a tak se rozhodnou odejít. Po cestě narazí na otevřené studio slečny Patty a tak jdou dovnitř, lehnou si a po chvíli usnou. Ráno je tam najde slečna Patty a Rory běží domů vše vysvětlit Lorelai a Emily.",
    "thumb": "https://image.tmdb.org/t/p/w500/1IewwedoYVH80yBoYRK03FFtT7v.jpg"
  },
  "S01E10": {
    "title": "Odpuštění",
    "plot": "Na páteční večeři odjíždí Rory sama, protože Lorelai bude dlouho v práci. Při večeři se udělá Richardovi nevolno. Lorelai se šla najíst k Lukovi do bistra, když v tom ji volá Rory, že je Richard v nemocnici. Okamžitě se Lorelai s Lukem vydají do nemocnice.",
    "thumb": "https://image.tmdb.org/t/p/w500/oga6b9Zd6Bj4kZf6gZkHOzLiMjC.jpg"
  },
  "S01E11": {
    "title": "Hoří Paříž",
    "plot": "Lorelai zvažuje adopci psa. Chystá se chiltonský každoroční Den rodičů a Emily nabídne Lorelai, že by na tuto akci šla ráda místo ní. Na Dni rodičů uvidí Paris Lorelai a Maxe v objetí a rozhlásí to po škole. To se donese až k řediteli a Maxovo místo je ohroženo.",
    "thumb": "https://image.tmdb.org/t/p/w500/69iSBrSeHm9ZQQIEgzJeeJ6Vih7.jpg"
  },
  "S01E12": {
    "title": "Dvojí rande",
    "plot": "Sookie chce jít na rande s Jacksonem, ale v ten den za ním přijíždí jeho bratranec Rune a tak Sookie domluví rande Runovi s Lorelai. Lane je bláznivě zamilovaná do Deanova kamaráda Todda a poprosí Rory, aby ji domluvila rande.",
    "thumb": "https://image.tmdb.org/t/p/w500/xQfFZZcwBL2A506egT2s6xXIueM.jpg"
  },
  "S01E13": {
    "title": "Narušený koncert",
    "plot": "Lorelai se přihlásí jako dobrovolník na pořádaní výročního výprodeje. Pár věcí ji přinese i Luke. Lorelai se zalíbí mikina, kterou ji přinesl a obleče si ji. Jde se ukázat Lukovi, ale ten ji vynadá. Nechápající Lorelai jde za Sookie a ta ji řekne pravý důvod. Rory, Paris, Madeline a Louise jedou na koncert a dohled jim dělá Lorelai se Sookie, jenže se vše zvrtne, když zjistí, že Madeline s Louise odešli s neznámými kluky na mejdan.",
    "thumb": "https://image.tmdb.org/t/p/w500/AdtGkdHq340eJe7EqpIhTqudN7p.jpg"
  },
  "S01E14": {
    "title": "Ta zatracená Donna Reedová",
    "plot": "Lorelai, Rory a Dean sledují seriál o Donně Reedové, která je příkladnou ženou v domácnosti - vždy naklizeno, navařeno... Deanovi se Donnina pečlivost líbí a tak, když Rory hlídá Babette její kočičku, pozve k ní Deana a hraje si na Donnu Reedovou. Lorelai má za úkol po dobu co Rory nebude doma, starat se o kuře, o které musí Rory pečovat za domácí úkol, ale kuře ztratí. Do Star Hollow přijíždí Christopher - Roryin otec.",
    "thumb": "https://image.tmdb.org/t/p/w500/9pNxd85YinmgCstIorNoHdeaqVy.jpg"
  },
  "S01E15": {
    "title": "Christopher se vrací",
    "plot": "Christopher se na pár dní ubytoval u Lorelai. Snaží se s Rory trávit co nejvíce času a chce ji koupit drahý slovník, ale jeho kreditní karta je odmítnuta. Emily s Richardem pozvou na večeři Lorelai, Christophera, a Christopherovi rodiče. Na večeři se do Lorelai ostře opře do Lorelai, že Christopherovi zničila život.",
    "thumb": "https://image.tmdb.org/t/p/w500/fgagsZNtVy3WoeItuNUZ9QpCzjs.jpg"
  },
  "S01E16": {
    "title": "Osudoví milenci a jiní cizinci",
    "plot": "Rory prosí Lorelai, aby ji omluvila z páteční večeře, protože má s Deanem 3-měsíční výročí. Na páteční večeři čeká Lorelai opravdové překvapení. Emily pozve syna své kamarádky s úmyslem dát je dohromady. Do města přijede Rachel - Lukova bývalá přítelkyně.",
    "thumb": "https://image.tmdb.org/t/p/w500/f7ZGjbQ9UrPoRJDAFxB9vLDIkGw.jpg"
  },
  "S01E17": {
    "title": "Rozchod",
    "plot": "Dean se s Rory rozejde. Rory je druhé ráno plná energie a Lorelai vzbudí v 6 ráno s dlouhým seznamem plný úkolů, které musí ten den splnit. Rory jde s Lane na party, kterou pořádá Madeline a sblíží se s Tristanem. Lorelai odjíždí za Maxem.",
    "thumb": "https://image.tmdb.org/t/p/w500/diGHS6rujWCDZZE9EK1oYjzbH52.jpg"
  },
  "S01E18": {
    "title": "Třetí Lorelai",
    "plot": "Na páteční večeři Richard oznámí, že přijede jeho matka - Lorelai. Všichni jsou nadšeni kromě Emily. Rory domluví rande Paris a Tristanovi, ale nedopadne to podle jejich představ.",
    "thumb": "https://image.tmdb.org/t/p/w500/7ttOZmxVR2x3U13VxPw6Jz4Lis5.jpg"
  },
  "S01E19": {
    "title": "Emily v říši divů",
    "plot": "Rory pozve Emily do Star Hollow, aby si vybrala ve starožitnictví paní Kimové nové židle a při té příležitosti ji provází celým městem a dovede ji k domu, kde jako dítě bydlela s Lorelai. Lorelai se jede s Rachel podívat no starý hotel U Vážky, který ji zaujal při prohlížení si Rachelin fotek.",
    "thumb": "https://image.tmdb.org/t/p/w500/ts4D7Jj50h9yJ60DYmgjF4OGblJ.jpg"
  },
  "S01E20": {
    "title": "PS: Miluji Tě",
    "plot": "Rory se vyhýbá Deanovi a když zjistí, že Lane pracuje s Deanem na domácím úkolu naštve se na ni. Lorelai si domluví rande s Maxem, ale Rory o tom nic neřekne, když to Rory zjistí, pohádá se s Lorelai a uteče. Loreli ji s Maxem všude hledá.",
    "thumb": "https://image.tmdb.org/t/p/w500/A2abkBkNf7D6fibfoUSPETSVaoY.jpg"
  },
  "S01E21": {
    "title": "Láska, kopretiny a trubaduři",
    "plot": "Rory se rozhodne zajít za Deanem do obchodu, ten tam však není a tak jde k němu domů. Luke se svěřuje Lorelai, že mu Rachel začíná vadit. Tristan neustále obletuje Rory a všude vykládá, že spolu chodí, což se Rory pochopitelně nelíbí.",
    "thumb": "https://image.tmdb.org/t/p/w500/uQiuj21vGMi9Qye8zFEkUH6ZzAE.jpg"
  },
  "S02E01": {
    "title": "Zásnuby",
    "plot": "Lane se vyděsí, když jí rodiče koupí na léto jednosměrnou letenku do Koreje; Luke dá Lorelai hodně námětů k přemýšlení, když mu řekne o Maxově žádosti o ruku; Lorelai nakonec řekne Maxovi \"ano\" a řekne to všem kromě rodičů; když Rory přivede Deana na speciální večeři do domu prarodičů, aby oslavila, že se dostala na Chiltonu mezi 3% nejlepších, a Richard napadne Deana, že nesplňuje Gilmorova měřítka dokonalosti, Rory se Deana zastane a způsobí rozkol mezi Richardem a jeho vnučkou; Emily je zdrcená, když se o svatbě dozví od Sookie místo od Lorelai.",
    "thumb": "https://image.tmdb.org/t/p/w500/aIUD7sGaDjTj1GnBizqfFPStudG.jpg"
  },
  "S02E02": {
    "title": "Horečné přípravy",
    "plot": "Rory je ve stresu, že je příliš pozadu s mimoškolními aktivitami, což naruší její vztah s Deanem; Henry projeví zájem chodit s Lane; Richard a Rory urovnají své neshody; Emily se cítí dotčená, že se to dozvěděla jako poslední, a když jí dcera konečně oznámí dobrou zprávu, přijme ji Lorelai chladně; na zásnubní večírek Lorelai a Maxe se dostaví celé Stars Hollow.",
    "thumb": "https://image.tmdb.org/t/p/w500/ukajpCOXTByrreAzZLtLMnx9B9V.jpg"
  },
  "S02E03": {
    "title": "Svatba má červenou",
    "plot": "Lorelai, Sookie, Emily, Michel a Rory jdou do drag klubu na Lorelainu rozlučku se svobodou; Emily vypráví skupině historky o týdnu před svatbou, z nichž některé Lorelai přimějí zamyslet se nad vlastními pocity ohledně manželství; když všichni ostatní odejdou zavolat svým miláčkům, Lorelai místo Maxovi zavolá Christopherovi; později večer doma Lorelai oznámí Rory, že ruší svatbu, protože si uvědomila, že Max není ten pravý pro ni; matka s dcerou se rozhodnou vyrazit na výlet, aby se vyhnuly sympatiím celého Stars Hollow.",
    "thumb": "https://image.tmdb.org/t/p/w500/qJ73wsadPJ735Swqjk1o6ZZpBFi.jpg"
  },
  "S02E04": {
    "title": "Výlet do Harvardu",
    "plot": "Aby unikly reakci všech na zprávu o zrušeném zasnoubení, vyrazí Lorelai a Rory na cestu a narazí na pekelnou noclehárnu, než nakonec dorazí na Harvard, kde Rory okusí vysokoškolský život a Lorelai přemítá o tom, co by mohlo být; Lane se vrací domů obtěžkaný bootlegy ze Soulu; Lorelai se rozpláče, když uvidí chupu, kterou pro ni vyrobil Luke; Luke soucítí s Lorelai, i když je tajně nadšený, že se svatba ruší; Lorelai se rozhodne, že začne vážně přemýšlet o tom, jak uskutečnit svůj sen o otevření hostince.",
    "thumb": "https://image.tmdb.org/t/p/w500/xP5feMkYUF4IW5ZZYw918R1yOic.jpg"
  },
  "S02E05": {
    "title": "Nick a Nora, Sid a Nancy",
    "plot": "Lukova sestra Liz se obává, že její sedmnáctiletý syn Jess má problémy, a proto ho posadí do autobusu do Stars Hollow, aby tam žil s Lukem. Lorelai se to dozví a nabídne Lukovi poradenství ohledně péče a výživy teenagera, ale je odmítnuta. Neodolá a uspořádá večeři pro Jesse, který je mrzutý a naštvaný na všechny kromě Rory. Při první příležitosti si vezme z lednice pivo a vytratí se na zadní verandu. Lorelai ho najde a udělí mu přednášku o tom, jak dobře se má s Lukem. Jess jí řekne, co si může dovolit se svým proslovem, a pak odejde. Když se Luke dozví o Lorelaině vměšování, pohádají se a on jde Jess najít.\n\nTaylor druhý den zavolá Lukovi a obviní Jess z krádeže peněz z kontejneru mostního fondu na trhu. Luke konfrontuje Jesse kvůli tomuto obvinění a je z jeho odpovědi tak frustrovaný, že ho strčí do jezera. Uvědomí si, že potřebuje Lorelainu pomoc, a vydá se k ní domů, aby vše napravil, jenže zjistí, že jeden z Babettiných",
    "thumb": "https://image.tmdb.org/t/p/w500/wLQgjWzv40XgWl3IwhQxWREy4qd.jpg"
  },
  "S02E06": {
    "title": "Debutantka Lorelai Gilmorová",
    "plot": "Richard, který je na Emily stále podrážděnější a svárlivější, začíná v kanceláři trávit více hodin než kdykoli předtím. Aniž by to Emily řekl, zruší kvůli pracovnímu tlaku několik důležitých společenských akcí, což ji rozruší a zároveň znepokojí. Na naléhání svých přátel se rozhodne, že Roryin debut na společenském plese bude tím pravým, co Richarda vrátí do společenského kolotoče. K Lorelainu úžasu Rory ochotně souhlasí a Emily v rámci příprav rozjede nákupy na plné obrátky.\n\nDean hlasitě protestuje proti formálnímu oblečení, které je nucen nosit, a lekcím foxtrotu, které musí absolvovat u slečny Patty, a tak mu Rory slíbí doživotní sledování Bitevních robotů po jeho boku, pokud bude hodný a půjde s touto příležitostí.",
    "thumb": "https://image.tmdb.org/t/p/w500/hkjMxyYmwx1PlQcFkQ3dZZR1ksR.jpg"
  },
  "S02E07": {
    "title": "Jablko nepadá daleko od stromu",
    "plot": "Ředitel Charleston rozhodne, že obě Gilmorova děvčata musí zlepšit své socializační dovednosti na Chiltonu, pokud chtějí, aby napsal pochvalné doporučení pro Roryinu přihlášku na Harvard.\n\nPrvní Roryin pokus o socializaci vede k tomu, že se při obědě zeptá skupinky dívek, zda se k nim může přidat. Ty souhlasí a skvěle si padnou do oka. Po obědě se na Rory oboří šíleně žárlivá Paris a řekne jí, že skupina, do které nevinně vpadla, jsou \"\"Puffky\"\", slavné tajné Chiltonovo sesterstvo. Paris by udělala cokoli, aby se k nim mohla přidat, a prosí Rory, aby ji před skupinou nepomlouvala. Při nejbližší příležitosti Rory Paris do skupiny přemluví a obě jsou přijaty za nováčky. Puffové \"\"unesou\"\" Rory, Paris a ostatní nováčky velmi brzy ráno pod záminkou, že je vezmou na snídani, ale místo toho je odvedou do kanceláře ředitele Charlestona, aby je zasvětili do skupiny. Uprostřed obřadu je objeví Charleston a ochranka.",
    "thumb": "https://image.tmdb.org/t/p/w500/tqJ9nLP4tCzXYS8ht4cxejQHWcZ.jpg"
  },
  "S02E08": {
    "title": "Náš hotel",
    "plot": "Lorelai a Sookie připravují své plány na otevření hostince, ale narazí na překážku, když majitel jejich vysněného místa odmítne nemovitost prodat. Nečekaný příjezd Mii, nepřítomné majitelky hostince Independence, situaci ještě více zkomplikuje, když Lorelai začne pociťovat výčitky svědomí, že Mii opět přenechává zodpovědnost za vedení hostince. Když Lorelai konečně sebere odvahu a řekne jí o svých plánech, Mia ji podpoří a s nadšením jí oznámí, že právě tohle byla příležitost, na kterou čekala, aby Inn prodala. Lorelai je z této zprávy zarmoucená a vypráví Emily, jak moc pro ni Inn znamená jako místo, kde společně s Rory vyrůstaly, a nevnímá bolest, kterou tím způsobuje své matce. Lorelainin citový zmatek vyvrcholí tím, že se poprvé v životě pohádá se Sookie. Po Lukově povzbudivé řeči se Lorelai Sookie omluví a znovu se zaváže k jejich přátelství a partnerství.",
    "thumb": "https://image.tmdb.org/t/p/w500/xLl4nSJ57unLp0Ft0KE16ykxbYZ.jpg"
  },
  "S02E09": {
    "title": "Mladíček na útěku",
    "plot": "Lorelai dostane pozdě svatební dar bez přiloženého přání a trvá na jeho vrácení. Sookie vidí, jak velké úsilí Lorelai vynaloží, aby zjistila, kdo ho poslal, a řekne Lorelai, aby se v životě posunula dál a uzavřela svůj vztah s Maxem. Lorelai její radu poslechne a přijme schůzku na večeři s Paulem, jedním z dalších studentů její obchodní třídy. Rande dopadne dobře, ale rozhodnou se zůstat přáteli, protože nemají příliš mnoho společného. Když se Paul následující sobotu objeví u Luka s rodiči v závěsu, Lorelai si všichni ve městě dobírají, protože je tak mladý. Luke je nezvykle zamlklý, což Lorelai nedokáže pochopit, dokud mu Sookie nevysvětlí, že je do Lorelai odjakživa zamilovaný. Lorelai jde za ním, aby mu dala najevo, že bude vždycky velmi důležitou součástí jejího života, a Luke se opět rozzáří.",
    "thumb": "https://image.tmdb.org/t/p/w500/sQlIlWmXu4xCc0sznGBLq62RBEs.jpg"
  },
  "S02E10": {
    "title": "Slavnostní večeře",
    "plot": "Sněhová bouře zabrání skupině lidí zúčastnit se historické večeře, kterou Sookie na jejich přání pečlivě připravila, a tak se s Lorelai rozhodnou pozvat všechny své přátele ze Stars Hollow, aby si hostinu užili v hostinci. Na Roryino naléhání Lorelai pozve také Richarda a Emily, aby Richardovi zvedla náladu. Během večeře je Emily zraněná a rozzlobená, když jí Richard prozradí, že dal výpověď, aniž by se s ní poradil. Jess se snaží dostat mezi Rory a Deana, když Deana vyruší jeho malá sestra.",
    "thumb": "https://image.tmdb.org/t/p/w500/fudu18lcHh0OsD47Mb6bwVYoRtQ.jpg"
  },
  "S02E11": {
    "title": "Tajnosti a půjčky",
    "plot": "Lorelai a Rory se pohádají poté, co Rory v rozporu s matčiným přáním požádá prarodiče, aby Lorelai půjčili peníze, které potřebuje na opravu jejich domu poškozeného termitem; Laneina touha stát se roztleskávačkou způsobí napětí v jejím vztahu s Rory; po vyčerpávajícím a neproduktivním pokusu získat potřebné finanční prostředky na základě vlastního úvěrového ratingu je Lorelai nucena požádat Emily o spolupodpis půjčky; Rory přivede Parise k šílenství, když odmítne prozradit své výsledky v testu PSAT.",
    "thumb": "https://image.tmdb.org/t/p/w500/tJWZL7jvR6DKjkiLEztw6X7PMjb.jpg"
  },
  "S02E12": {
    "title": "Richard ve Stars Hollow",
    "plot": "Richard navštíví Stars Hollow a přivádí Lorelai a Rory k šílenství tím, že posuzuje každý aspekt jejich života.",
    "thumb": "https://image.tmdb.org/t/p/w500/csGTXbDxMBUQri18sQlwafyoYpx.jpg"
  },
  "S02E13": {
    "title": "Kdo koupí můj koš",
    "plot": "Každoroční aukce charitativních obědových košů ve Stars Hollow vyvolává spory mezi páry ve městě; Jess přeplatí Deana za Roryho koš, což způsobí, že se Dean a Rory pohádají, když Rory dodrží tradici a rozdělí se o oběd s Jessem; Jackson odmítne přihazovat na Sookiin košík poté, co ho přiměje k domněnce, že s ní nechce bydlet; Luke přijde Lorelai na pomoc, přihazuje na její košík a oba je v bistru nakrmí poté, co slečna Patty dohodí Lorelai trojici nevhodných zájemců; Henryho unavují závěrečné útěky kolem paní Rory. Kim a dá Lane vale; Rory a Jess si u oběda padnou do oka a Jess odchází s tajným suvenýrem - náramkem, který dal Dean Rory, a on ho sebere a podrží si ho poté, co ho Rory upustí; Sookie a Jacksonovi to klape tak dobře, že ji požádá o ruku a ona přijme; Lorelai a Rory se pohádají, když Rory zjistí, že její matka projevila pochopení pro Deanovy obavy ohledně Jess;",
    "thumb": "https://image.tmdb.org/t/p/w500/4mWreplDfBPUxtvDCIiS9tITzFl.jpg"
  },
  "S02E14": {
    "title": "Měla to být Lorelai",
    "plot": "Christopher přijíždí do města na služební cestu se svou přítelkyní Sherrie v závěsu. Protože vztah Sherrie a Christophera začíná být vážný, chce se Sherrie začít sbližovat s Rory - v pátek večer. Lorelai, aniž by se poradila s Emily, omluví Rory z páteční večeře Gilmorových a místo ní vezme s sebou Christophera. Když se Emily u koktejlů dozví o Sherrie, zhroutí se a odběhne do kuchyně. Lorelai ji tam následuje a zjistí, že Emily si vždycky představovala, že Lorelai a Christopher skončí spolu. Teď, když vidí, že se to nestane, Emily Lorelai vyčítá, že si ho i všechny ostatní vždycky držela od těla. Poté, co Lorelai přemýšlí nad matčinými slovy, druhý den ráno Christopherovi řekne, že si vždycky myslela, že se k sobě také vrátí, a proto nikdy neměla trvalý vztah, včetně toho s Maxem.",
    "thumb": "https://image.tmdb.org/t/p/w500/fGO0YuepPaOPH8H50sUvVm7a6qt.jpg"
  },
  "S02E15": {
    "title": "Ztráty a nálezy",
    "plot": "Rory se pustí do kampaně za zlepšení vztahu Lorelai s Jessem a přesvědčí ji, aby mu dovolila vyčistit jejich okapy, a tak si přivydělat nějaké peníze.\n\nLuke nemůže vystát, jak stísněné je jeho bydlení teď, když jeho sestra poslala všechny Jessiny věci do Stars Hollow, a tak se vydává na lov bytu, nejprve s Jess a pak s Lorelai, která mu konečně najde skvělé bydlení. Když se později dozví, že jeho novým pronajímatelem bude Taylor, vybuchne, řekne Taylorovi, aby jeho žádost vyhodil, impulzivně koupí budovu, v níž sídlí jeho bistro a vedlejší květinářství, a začne bourat přilehlou zeď, aby si rozšířil obytný prostor.",
    "thumb": "https://image.tmdb.org/t/p/w500/w4Z5Z1Ex65RNUL5hkZZOj9PRWrE.jpg"
  },
  "S02E16": {
    "title": "Matka a dcera",
    "plot": "Když Emily a Lorelai jedou na víkend do lázní, aby si odpočinuly, Emily si rozpustila vlasy, zvedla podpatky a nakonec se s Lorelai sblížila způsobem, který může inspirovat jen její dcera.\n\nRory je nadšená, že má dům jen pro sebe, a doufá, že stráví klidnou noc doma praním prádla a pojídáním indického jídla. Její plány však překazí - nejprve Paris, pak Jess a nakonec Dean. Přitom zjistí, že má překvapivého zachránce, tajného nápadníka a skeptického miláčka.",
    "thumb": "https://image.tmdb.org/t/p/w500/k9WW0T6M5Y1E96CIDSFTvM67Fvp.jpg"
  },
  "S02E17": {
    "title": "Pohřeb na přání",
    "plot": "Lorelai a Rory si přivydělávají v bistru, zatímco Luke plánuje pohřeb svého strýce Louieho; Taylor se neovládne, když se na náměstí otevře farmářský trh a zhatí jeho podnikání; Emily to s pomocí Sookie při plánování svatby úplně přežene; Rory přemlouvá Jess, aby jí víc pomáhala; Luke je naštvaný, když rodina a přátelé uvádějí Louieho nepříjemnou povahu jako důvod, proč se nezúčastní jeho pohřbu, ale je uklidněn, když Stars Hollow nakonec vyjde vstříc jemu i jeho strýci.",
    "thumb": "https://image.tmdb.org/t/p/w500/q8axG52V12amLTAseVAVv3XwK7R.jpg"
  },
  "S02E18": {
    "title": "Výkonný dědeček",
    "plot": "Rory požádá Richarda o pomoc s vytvořením a prodejem lékárničky pro každoroční Chiltonův obchodní veletrh, což ho přivede k poznání, že je v důchodu nešťastný a chce začít druhou kariéru; Dean, čerstvě po podcenění Roryina koše na oběd a ztrátě náramku, který pro ni vyrobil, přehání snahu být Rory nablízku, protože se bojí, že o něj ztrácí zájem, a nakonec se smíří s její náklonností k Jessovi; Michel je zprvu nadšený, když ho navštíví jeho rázná matka Giselle, ale poté, co mu Lorelai způsobí problémy, když Giselle prozradí, že Michel před matkou něco tajil, Michel se z matčina neustálého vyptávání rychle zblázní.",
    "thumb": "https://image.tmdb.org/t/p/w500/qHSup0XK2L4ObWWQxfOHMwT5YgL.jpg"
  },
  "S02E19": {
    "title": "Doučování",
    "plot": "Lorelai si stěžuje na Taylorovu volbu pro večer \"Movie in the Square\" a je pověřena výběrem večerní zábavy, ale její nadšení z tohoto úkolu rychle opadne, když jí Taylor oznámí, že si musí vybrat ze seznamu volných filmů, který neobsahuje žádná mistrovská díla; navzdory svému nejlepšímu úsudku Lorelai souhlasí s Lukovou žádostí, aby Rory doučovala téměř zfetovanou Jess; Rory a Jess se rozhodnou udělat si přestávku od učení a zajít si na zmrzlinu, a když Jess sedí za volantem, stanou se účastníky autonehody, při níž má Rory zlomené zápěstí a zdemolované auto; rozrušená Lorelai obviní z nehody Luka, což způsobí vážnou trhlinu v jejich vztahu; Christopher přijíždí uprostřed noci připraven vydat se za Jessem, ale ten už opustil Stars Hollow a vrátil se domů; na Movie Night má premiéru Kirkův krátký film.",
    "thumb": "https://image.tmdb.org/t/p/w500/ekrsYl28osoBmuVOMlpONyU2a4J.jpg"
  },
  "S02E20": {
    "title": "Hledá se pomocnice",
    "plot": "Richard si s Lorelainou pomocí otevře novou kancelář a najme sekretářku; Dean se vrátí domů; Lane se zamiluje do bicí soupravy v novém hudebním obchodě ve Stars Hollow a zjistí, že stát se rockovou bubenicí je jejím novým životním snem; Rory s hrůzou zjistí, že všichni navzdory jejím protestům viní Jess z nehody; ke zděšení všech ve Stars Hollow Luke zavře bistro a odjede na ryby.",
    "thumb": "https://image.tmdb.org/t/p/w500/tQldK62m19J1eWQnnla3rAhrOgC.jpg"
  },
  "S02E21": {
    "title": "Absolventka",
    "plot": "Lorelai a Rory snídají u Sookie ve snaze vyhnout se Lukovi, ale Lorelai se nevyhne trapnému setkání s ním v Doose's Market, kde se mu nepodaří zachytit její náznaky, aby vše urovnal; Rory ve snaze pomoci Lorelai překonat stres ze závěrečných zkoušek ji nadchne pro účast na slavnostní promoci na vysoké škole a tajně pozve Richarda a Emily, přestože Lorelai tvrdí, že by s účastí nikdy nesouhlasili; po nočním telefonátu od Jesse Rory impulzivně přeruší druhý den školu a navštíví ho na Manhattanu; Christopher pošle Lorelai dárkový koš k promoci plný zábavných dobrot a drahý náhrdelník; Lorelai je šokována, když vidí Emily, Richarda a filmový štáb, který je doprovází na její promoci, a musí se potýkat s nepříjemnou spolužačkou s názorem na bohaté; Rory je na sebe naštvaná, když jede domů špatným autobusem.",
    "thumb": "https://image.tmdb.org/t/p/w500/qo7Xwe9HcCyYhqYPkUtHufkUmLJ.jpg"
  },
  "S02E22": {
    "title": "Nějak nám to nevychází",
    "plot": "Sookiina svatba se blíží a ženich i nevěsta začínají být nervózní, nemluvě o Michelovi, kterého Lorelai pověřila vedením příprav v hostinci.\n\nLorelai nakonec ustoupí a jde do bistra, kde se Lukovi, který je zdvořilý, ale chladný a poněkud odtažitý, vydatně omlouvá.\n\nChristopher přijíždí do města kvůli odstranění Roryiny sádry a rozhodne se zůstat na Sookiinu svatbu. Poté, co se přizná, že jeho vztah se Sherrie skončil, obnoví s Lorelai svůj vztah, což potěší Rory i Emily. Jejich shledání je však přerušeno, když Sherrie zatelefonuje Christopherovi, že je těhotná, a Christopher se vrací do Bostonu, čímž zanechává Lorelai zničenou.",
    "thumb": "https://image.tmdb.org/t/p/w500/3Eowa3CuOczlFtB06975uDKdVsh.jpg"
  },
  "S03E01": {
    "title": "Návrat domů",
    "plot": "Lorelai se uprostřed smutku z Christophera zdá zajímavý sen o Lukovi; Rory se vrací z Washingtonu a uvědomuje si, že možná stále něco cítí k Jessovi, ale náhodné setkání na prvním ročníku festivalu Stars Hollow End of Summer Madness ji přiměje uvědomit si, že si možná našel jinou; hádky ve vztazích jsou četné - Sookie a Jackson kvůli výzdobě jejich domu, Lorelai a Rory kvůli Jessovi versus Deanovi, Emily a Richard kvůli Lorelai a Christopherovi - ale jsou na cestě k vyřešení; a Rory opět provede Parise kamenitými mělčinami přípravy na rande.",
    "thumb": "https://image.tmdb.org/t/p/w500/8x1NwbBSOgCa5VjvxGNhYYlAjwc.jpg"
  },
  "S03E02": {
    "title": "Zkrácení sukní",
    "plot": "K Lorelaině hrůze ji Kirk pozve na rande poté, co ho k tomu vyzval Luke; Emilyin oběd s Lorelai u Luka skončí špatně; Christopher se objeví bez pozvání na páteční večeři a pohádá se s Lorelai i Rory, než ho Emily požádá, aby odešel; Rory narazí na Jess a obě si prozradí své ublížené city - Rory kvůli Shaneovi a Jess kvůli tomu, že o Rory celé léto neslyšela; a Francie se zaměří na Paris a Rory a připraví jim problémy, pokud Rory nezabrání Paris v tom, aby studentskou radu řídila jako diktaturu.",
    "thumb": "https://image.tmdb.org/t/p/w500/gGn59oMoB7Oj2k1W1sx4yqQFqjo.jpg"
  },
  "S03E03": {
    "title": "Hrůza z přihlášky",
    "plot": "Přijde Roryina přihláška na Harvard, což Rory, Lorelai a Emily přivede k šílenství; Chiltonův seminář o přihláškách na vysokou školu jen prohloubí Roryinu úzkost a Paris se z toho rozčílí; Taylor přiměje Luka, aby si vedle bistra otevřel obchod s limonádami; Lane si dá do novin inzerát na kapelu a najde spřízněnou hudební duši; Lorelai a Rory povečeří s absolventem Harvardu a jeho rodinou, což jí může zajistit šanci na přijetí; Dean si s Rory promluví o jejich budoucnosti poté, co půjde na Harvard.",
    "thumb": "https://image.tmdb.org/t/p/w500/rGPdamrSopWFd7yibAiTEhM8O93.jpg"
  },
  "S03E04": {
    "title": "Vítězství či prohra",
    "plot": "Lorelaino vystoupení na fóru místních úspěšných podnikatelů na střední škole Stars Hollow ztroskotá na kontroverzních osobních otázkách, což potěší Luka a vyvede z míry některé matky z rodičovského sdružení; Luke a Jess se hádají o ženách v jejich životech (a šatnících); Lane zmírňuje svou frustraci z přísného chodu domácnosti a budoucnosti své kapely pestrým, i když dočasným projevem nezávislosti; Rory příliš často narazí na Shanea a propadne silnému záchvatu chrapláku.",
    "thumb": "https://image.tmdb.org/t/p/w500/fOjwBbHRLcQU3JvbsGRxGknfe76.jpg"
  },
  "S03E05": {
    "title": "V osm hodin v Oáze",
    "plot": "Lorelai se zúčastní Emilyiny společenské aukce, kde se seznámí s velmi pohledným mužem, ale zapomene si vzít jeho číslo, což ji donutí požádat o něj matku; po katastrofálním prvním rande Lorelai odmítne pozvání na další, aniž by si uvědomila, že Emily a Richard hodně investují do toho, aby chodila se synem jejich přátel; poté, co se Lorelai a Rory dohodnou, že budou zalévat trávník jejich nového souseda, zatímco on je mimo město, Jess přijde Rory na pomoc, když se porouchá zavlažovací systém trávníku.",
    "thumb": "https://image.tmdb.org/t/p/w500/btAubvZ1GhlTUXGs7yQ1lnILHmN.jpg"
  },
  "S03E06": {
    "title": "Vejce na divoko",
    "plot": "Lorelai šoféruje Rory na Sherryinu oslavu narození dítěte v Bostonu a je proti své vůli vtažena do oslav; slečna Patty má nového nápadníka; Jess se vrací domů s autem a Luke se snaží zjistit, kde vzal peníze na jeho koupi; jeden z výstřednějších občanů Stars Hollow žádá o povolení uspořádat demonstraci na náměstí.",
    "thumb": "https://image.tmdb.org/t/p/w500/f3aHIYO4e9f4SVvsih1EQSXl9zK.jpg"
  },
  "S03E07": {
    "title": "Taneční maraton",
    "plot": "Lorelai je odhodlaná vyhrát taneční maraton ve Stars Hollow a získat trofej od čtyřnásobného šampiona Kirka, ale má problémy sehnat partnera, až nakonec přesvědčí Rory, aby jí pomohla protančit se k vítězství. Dean sedí stranou, aby povzbudil svou dívku, a brzy se k němu připojí Jess a Shane, kteří tráví čas líbáním, zatímco Jess sleduje Rory. Lorelai si zlomí podpatek a Dean ji vystřídá, zatímco Luke si hraje na opraváře bot. Na tanečním parketu si Dean uvědomí, že Rory přitahuje Jess, a rozejde se s ní. Rory se slzami v očích uteče, těsně následována Jess, a Kirk je opět vyhlášen vítězem.",
    "thumb": "https://image.tmdb.org/t/p/w500/gLxsa9dDyl0D6AG1Fm8OFhFX2J7.jpg"
  },
  "S03E08": {
    "title": "A hra začíná",
    "plot": "Po tanečním maratonu se Kirk promenáduje po Stars Hollow s trofejí, dokud mu ji někdo neukradne, zatímco Lorelai a Rory se bolestivě belhají k Lukovi; poté, co Lorelai řekne Lukovi o Rory a Jessovi, přeruší jejich první polibek a poté stanoví Jessovi základní pravidla ohledně randění s Rory; Lorelai a Rory neochotně souhlasí, že přijmou Richardovo pozvání a doprovodí ho a Emily na sraz Whiffenpoofů na Yale, kde všechny tři ženy čeká nevítané překvapení; po návratu z New Havenu se Lorelai a Rory vydají k Lukovi a Jess a Rory se konečně dočkají prvního polibku; Rory navštíví Deana, aby se mu omluvila a řekla mu, že jí chybí jeho přátelství; pozdě v noci se Lorelai a Rory schoulí do klubíčka s četbou na dobrou noc - s brožurou o Yale.",
    "thumb": "https://image.tmdb.org/t/p/w500/466fesH2GNvqi3ECwEPweSfYXG6.jpg"
  },
  "S03E09": {
    "title": "Díkůvzdání",
    "plot": "Je Den díkůvzdání a Lorelai s Rory večeří na čtyřech různých místech: u Kimů, kam se Lane podařilo pozvat Davea a Lorelai je nucena jíst krůtí maso; u Luka, kde Luke a Jess tvoří čtveřici s Lorelai a Rory; u Sookie, kde Jackson a jeho rodina usmažili krocana, trávník a skoro všechno ostatní; a u Emily a Richarda, kde Rory k Lorelaině hrůze prozradí, že se přihlásila na Yale. Kirk si pořídí kočku, což má katastrofální následky; Dave pozve Lane na rande a pak ji políbí; Paris se bojí, že její potíže s přijetím do útulku ovlivní její přijetí na Harvard; a Dean se utká s Jessem a dá mu najevo, že pro pana Forestera už to není žádný \"pan Hodný\".",
    "thumb": "https://image.tmdb.org/t/p/w500/6ErztWS0nCQmSVm0WsxuI5tZ8vw.jpg"
  },
  "S03E10": {
    "title": "Nečekaná návštěva",
    "plot": "Lorelaina babička nečekaně přijede do Hartfordu v den Richardových narozenin a oznámí, že se stěhuje zpátky, což Emily vyvede z míry, dokud se neřídí Lorelainou radou, jak zvládnout tchyni; Rory vyhlásí válku Francie poté, co se na Paris vytasí se studentskou radou; Paris se po vánočních prázdninách strávených s Jamieho rodinou zamiluje; poté, co na sebe Rory a Dean několikrát narazí, se rozhodnou, že se opět spřátelí; Jess nejprve odmítne Roryho nabídku zúčastnit se zimního karnevalu na Stars Hollow High, ale změní názor poté, co narazí na Deana a jeho sestru Claru, která Roryho pozve, aby se k nim přidal; Jess na karnevalu zastihne Deana o samotě a dá mu najevo, že je moudrý z jeho plánů získat Rory zpět.",
    "thumb": "https://image.tmdb.org/t/p/w500/2NpTmRoGC27QUj8EJ6TRyZsxh8I.jpg"
  },
  "S03E11": {
    "title": "Slavnostně přísahám",
    "plot": "Když se Lorelai a Sookie zúčastní semináře o provozování hostince a narazí na dva pohledné muže - Sookiina starého přítele a jeho obchodního partnera -, Lorelai se neúspěšně brání výpovědi, když její matku žaluje bývalá služebná za neoprávněné propuštění; poté, co se Rory a Francie střetnou na schůzi studentské rady, Francie navrhne příměří a vzápětí Paris zalže, že se ji Rory snaží podrazit; Paris je zdrcená, že ji její nejlepší kamarádka zradila, a vyjede na ni během jejich hodiny šermu, čímž Rory ostrakizuje zbytek studentstva.",
    "thumb": "https://image.tmdb.org/t/p/w500/cvtm8Bwe03v0GixzGnB0Cba9giw.jpg"
  },
  "S03E12": {
    "title": "Milovnice ryb",
    "plot": "Luke je proti tomu, aby Taylorova právnička Nicole dohlížela na papírování stavby nové sodovkárny, dokud nepotká atraktivní zrzku, která si Luka okamžitě oblíbí stejně jako on ji; Lanein chytrý plán, jak získat matčino svolení k účasti na maturitním plese, se strašlivě zvrtne; Luke nabídne Lorelai, že ji naučí umění rybařit, když ji Alex pozve na ryby; Rory a Lorelai vyklidí garáž pro Laneinu kapelu a Lorelai získá nového obdivovatele z kapely; Lane a Rory si upřímně popovídají o mužích ve svých životech; Parisin konflikt mezi ní a Rory, když požaduje Roryino odvolání studentskou radou, rychle ukončí ředitel Charleston, který vyhrožuje, že zruší oslavné dopisy, které pro každou z nich napsal na Harvard.",
    "thumb": "https://image.tmdb.org/t/p/w500/h5sn2jotQjWVUuBBznSMjTss0mb.jpg"
  },
  "S03E13": {
    "title": "Milá Emily a Richarde",
    "plot": "Luke a Nicole mají úspěšné první rande; Jess a Dean si vyměňují slovní přestřelky; Sherry rodí jen s Lorelai a Rory; Lorelai vzpomíná na své těhotenství a Roryin porod; Lorelai seznamuje Emily s moderní zábavní technikou; Richard a Emily odsuzují plány Lorelai a Rory procestovat Evropu s batohem na zádech; válka mezi Paris a Rory pokračuje, když Paris vybere do ročenky fotku zaměstnanců \"\"Franklinu\"\", na které je nejhorší možný záběr Rory.",
    "thumb": "https://image.tmdb.org/t/p/w500/53d8ahIY0smpALXyWisUvDyerid.jpg"
  },
  "S03E14": {
    "title": "Labutí píseň",
    "plot": "Emily přiměje Rory, aby vzala Jess na páteční večeři, která se ukáže jako naprostá katastrofa; Lorelai, Alex, Sookie a Jackson jedou na víkend do New Yorku; Jess si při hádce s protivníkem udělá monokl, který se stydí prozradit komukoli jinému než Lukovi; Zach a Brian si uvědomí, že Lane a Dave před nimi něco tají, ale netrefí pravou podstatu tajemství; Rory a Jess se poprvé pohádají a Luke jim pomůže vše urovnat.",
    "thumb": "https://image.tmdb.org/t/p/w500/mkPnz9cqaCkGLM3YNBEavIMvxOq.jpg"
  },
  "S03E15": {
    "title": "Konfrontace",
    "plot": "Do hostince vtrhne klan Dooseových na rodinné setkání; Trix přijede na krátkou návštěvu a přivádí Emily k šílenství, dokud Emily konečně nenajde něco skandálního, co by Trix vytkla; Lane a Dave vymyslí falešné rande s Mladým Chuiem, aby získali paní Dooseovou. Kim, aby dovolila Laneovi chodit s Davem, ale ani skutečná přítelkyně Young Chui, ani Dave nejsou imunní vůči troše žárlivosti; hokejový tým Stars Hollow High se poprvé po 40 letech dostane do regionálního semifinále a všichni, kdo se nezúčastní srazu monster trucků, přijdou povzbudit tým a přetrpět Kirkovo beznadějně neumělé hraní; poté, co Rory kvůli Jessově příliš uvolněnému přístupu k chození ven zůstane většinu víkendu sama doma, poslechne Lorelai a vydá se na hokejový zápas, kde zjistí, že Dean má novou přítelkyni.",
    "thumb": "https://image.tmdb.org/t/p/w500/7QWwItPg5lQSgut0dChrmzhovMp.jpg"
  },
  "S03E16": {
    "title": "Velká obálka",
    "plot": "Rory a Paris soutěží o čest promluvit na dvoustém výročí Chiltonu; Sookie a Jackson se dozvídají velmi dobré zprávy o změně života (a plenek); Paris a Rory se usmiřují; Lorelai narazí na Maxe a je zřejmé, že se přes sebe ještě nepřenesli; Paris se zhroutí v celostátní televizi, když se nedostane na Harvard; Rory konečně dorazí dopisy o přijetí na vysokou školu; Paris si není jistá, co si má myslet o nejnovějším vývoji svého vztahu s Jamiem.",
    "thumb": "https://image.tmdb.org/t/p/w500/92JyTlFautSGtPPBnZvoCeJLq7u.jpg"
  },
  "S03E17": {
    "title": "Seznam pro a proti",
    "plot": "Požár v hostinci Independence Inn donutí Lorelai přemístit hosty do svého domu a do domu svých přátel a nechá ji strávit noc u Luka, kde mu prozradí svůj sen o manželství a těhotenství s dvojčaty; Sookie vtrhne k Lukovi s personálem v závěsu, aby připravila snídani pro hosty hostince, a po těžkém začátku se s Lukem dostane do kulinářské pohody; vyvstanou otázky ohledně Jessovy docházky do školy, když dostane cenu Zaměstnanec měsíce od WalMartu a Luke zjistí, že tam pracuje na více než plný úvazek; Lorelai a Rory začnou vnímat podivné a poněkud nepřátelské vibrace, které přicházejí od Nicole a Lindsay; Rory navštíví Paris, která zameškala pět dní ve škole, aby se uložila do postele a schovala se před světem, a přiměje ji, aby přestala sledovat seriály, zavolala Jamiemu, řekla rodičům o Harvardu, sehnala si životní plán a vrátila se do země živých; poté, co sepsala rozsáhlé seznamy pro a proti ve snaze rozhodnout se, zda jít na Harvard, Yale nebo Princ.",
    "thumb": "https://image.tmdb.org/t/p/w500/hiXWe5JuqEcccDlaTekcwBQiba9.jpg"
  },
  "S03E18": {
    "title": "Všechno nejlepší, mami",
    "plot": "Emily a Richard se radují, když Rory oznámí, že se rozhodla studovat na Yale; Kirk utrpí zranění související s pečením, když Rory tajně požádá o pomoc své spoluobčany ze Stars Hollows, aby upekli největší pizzu na světě na oslavu narozenin její matky; Michel a Tobin soutěží o nejlepší dárek pro Lorelai, ale Richard soutěž s přehledem vyhraje šekem na 75 000 dolarů, který je ve skutečnosti výnosem z investice, kterou udělal na Lorelaino jméno při jejím narození; Luke konfrontuje Jesse kvůli tomu, že chodí za školu a pracuje ve Wal-Martu, ale jako obvykle je odpálkován; když se Lorelai rozhodne použít peníze na splacení školného za Rory na Chiltonu svým rodičům, Emily se rozzuří na Richarda, že dal Lorelai peníze, a bojí se, že splacení jejich půjčky je znamením, že už nikdy neuvidí ani Lorelai, ani Rory; Luke udělá špatný dojem na rodiče Nicole a vyděsí je řečmi o hrůzách výchovy Jesse.",
    "thumb": "https://image.tmdb.org/t/p/w500/16MAKA6bgcpvVhwbGCW35AMy6mP.jpg"
  },
  "S03E19": {
    "title": "První pořádný mejdan",
    "plot": "Během prvního volného pátečního večera si Lorelai a Rory nevědí rady, jak strávit večer, zatímco Emily a Richard se baví na večírku, který pořádají; Lorelai je jmenována pokladníkem Grad Night a na své první schůzce Chilton Booster Clubu narazí na hrajícího si Maxe; Laneina kapela má první vystoupení na večírku a rozproudí dům, ale Dave otřese Laneiným světem, když vyletí z kůže poté, co zjistí, že se do ní mladý Chui zamiloval; sklíčená Lane si dopřeje trochu moc piva a pak v opilosti zavolá matce a se vším se jí svěří; když snižování počtu zaměstnanců v hostinci donutí Lorelai, aby se věnovala obsluze na otočku, velmi ji zneklidní pohled na přítulného Luka a Nicole v pokoji, který jí byl nabídnut jako poděkování za Lukovu pomoc s opravami po požáru.",
    "thumb": "https://image.tmdb.org/t/p/w500/2RukPsaQQI9EFDto8ByXpldRPLL.jpg"
  },
  "S03E20": {
    "title": "Rozluč se, Gracie",
    "plot": "Fran Westonová umírá a Lorelei se Sookie se snaží koupit hostinec Vážka; Rory a Jess se snaží sblížit, ale nepodaří se jim promluvit; Dean řekne Rory, že se zasnoubil s Lindsay; paní Kimová souhlasí, aby Lane šla s Davem na ples; do Stars Hollow přijíždí Jessův otec.",
    "thumb": "https://image.tmdb.org/t/p/w500/oypWIXO55NmM0b68vQGkWmsJzhd.jpg"
  },
  "S03E21": {
    "title": "A je tu syn",
    "plot": "Jess se vydává do kalifornských Benátek, aby zjistil, že komunita jeho otce je stejně svérázná jako Stars Hollow; rozkol mezi Lorelai a Emily se prohlubuje; Luke řekne Lorelai, že Jess nadobro odjel; Lorelai čeká na správný okamžik, aby novinku sdělila Rory, která je ve stresu ze závěrečných zkoušek a maturity.",
    "thumb": "https://image.tmdb.org/t/p/w500/64v5Ej3e6BQseDF7gTQN1X9DEo8.jpg"
  },
  "S03E22": {
    "title": "To jsou nitky, Pinnocchio",
    "plot": "Rory se konečně dozvídá, že její matka si nemůže dovolit koupit hotel Dragonfly Inn, protože finanční pomoc na Yale neprošla. Rozhodne se vzít věci do vlastních rukou a těsně před promocí se vydá na rychlou návštěvu k prarodičům. Luke si výlet s Nicole rozmyslí poté, co mu něco řekne Lorelai. Jess naváže s Rory tichý kontakt poté, co přednese svůj projev na Chiltonu.",
    "thumb": "https://image.tmdb.org/t/p/w500/dOoeLNDM6uqEsqKTRBeU7P447ga.jpg"
  },
  "S04E01": {
    "title": "Společenský tanec a Italské sušenky",
    "plot": "Lorelai a Rory se vracejí ze svého turné po Evropě; Taylor a Luke si vyřizují účty kvůli nové sodovkárně; těhotná Sookie informuje Lorelai o nejnovějších zprávách o dítěti; Taylor špatně nese, když Rory odmítne privilegium stát se královnou zmrzliny ve Stars Hollow; matka s dcerou se dostanou do shonu poté, co si Rory uvědomí, že si napsala špatné datum nástupu do prváku a má na přípravu na Yale jen dva dny místo plánovaného týdne; Emily je naštvaná, když Lorelai zmešká páteční večeři, a tak se z ní stane čtyřhodinová extravagance s videem společenského tance před kurzem suflé; Lorelai je šokovaná, když jí Luke konečně řekne, co se stalo na plavbě s Nicole.",
    "thumb": "https://image.tmdb.org/t/p/w500/c50RwcarKUGvQtheaeFgkH4Sr.jpg"
  },
  "S04E02": {
    "title": "První den Lorelai na Yalu",
    "plot": "Luke je sice ochotný půjčit Lorelai svůj náklaďák, aby pomohl Rory přestěhovat se na kolej, ale není příliš nadšený, když se ukáže, že projekt zabere celý den, aby se Lorelai na poslední chvíli přizpůsobila nákupům, aby byl Roryin pokoj na stejné úrovni jako zbytek koleje, nemluvě o Lorelaině zdánlivé neschopnosti řídit auto, ztrátě náhradní pneumatiky a o tom, že si na něj naložila starou matraci z Roryina pokoje; Z Roryiných spolubydlících se vyklube sportovec, patnáctiletý zázrak, kterému velmi chybí socializační dovednosti, a nikdo jiný než samotná Miss People Person Paris Gellerová, která přijíždí s životním koučem v závěsu; do bistra se sjíždějí Nicolini partneři a hrozí, že Luka uvrhnou do pasti papírování a právních komplikací, když si odmítne najmout právníka nebo dokonce diskutovat o přijetí vyrovnání.",
    "thumb": "https://image.tmdb.org/t/p/w500/A7nUThZAr4FIfayzJs6HqI0rYCy.jpg"
  },
  "S04E03": {
    "title": "Hobit, pohovka a Digger Stiles",
    "plot": "Lorelai a Sookie se rozhodnou, že se stanou vedlejšími kuchařkami, aby pokryly náklady spojené s otevřením hostince, a jejich prvním úkolem je uspořádat tematický večírek \"Pán prstenů\". Na Yale se Rory vrátí ze školy a zjistí, že Emily předělala jejich pokoje. Richard mezitím zvažuje návrh na přijetí nového obchodního partnera.",
    "thumb": "https://image.tmdb.org/t/p/w500/van2WIe6Ta6L9KziTUrEciq6iTZ.jpg"
  },
  "S04E04": {
    "title": "Kuřecí nebo hovězí",
    "plot": "Po návratu domů na víkend se Rory nepříjemně setká se svým bývalým přítelem Deanem a nakonec je pozvána na jeho svatbu, která se koná následující den. Mezitím Lorelai a Sookie navštíví Michela v jeho novém moderním pracovišti, ale narazí na problémy se získáním povolení, které potřebují k zahájení stavby hostince.",
    "thumb": "https://image.tmdb.org/t/p/w500/nvUdYEp7jseGEmBugFr5p4jEgHp.jpg"
  },
  "S04E05": {
    "title": "Tady platí základní pravidla",
    "plot": "Rory přijme pozvání spolužačky na první rande od rozchodu s Jessem, zatímco její spolubydlící se pustí do války vůlí. Lorelai mezitím pozve Luka, aby s ním sdílela tradiční gilmorský filmový večer, který pořádala s Rory, ačkoli je poněkud rozrušená poté, co zjistí, že návrhář, kterého právě najala na výzdobu hostince, pracoval pro Emily.",
    "thumb": "https://image.tmdb.org/t/p/w500/9wyasNAGM6eHzFyD0wwj1VRuaie.jpg"
  },
  "S04E06": {
    "title": "Nezapomenutelný vztah",
    "plot": "Emily nabídne Lorelai a Sookie, aby se postaraly o pohoštění na večírku, který má zahájit Richardův nový podnik, a pak je zahrne svými požadavky. Mezitím ve škole Rory zjistí, že jí aktivity jejích spolubydlících brání v učení.",
    "thumb": "https://image.tmdb.org/t/p/w500/zvoEDMUwvDKVhbQH8y7q1QecYB5.jpg"
  },
  "S04E07": {
    "title": "Festival živých obrazů",
    "plot": "Sookie a Jackson se rozhodnou pro domácí porod a využijí služeb skvělé porodní asistentky; když Stars Hollow pořádá festival živých obrazů, Kirk to přežene s převlékáním se do role Ježíše v \"Poslední večeři\", zatímco Lorelai má těžkou trému; Lane, Zach a Brian konečně najdou skvělého kytaristu, který nahradí Davea, ale přemýšlejí, jestli není na členství v kapele příliš starý; Nicole se ptá Luka, jestli mohou odložit rozvod a začít spolu znovu chodit; Jacksonův bratr Beau, který přijel poskytnout morální podporu během porodu, není Stars Hollow příliš okouzlen a hned za Sookie vyjadřuje krajní frustraci z pozdního příchodu dítěte; Kirk, který doprovází Lulu městem, všem ve Stars Hollow hrdě a opakovaně připomíná, že má přítelkyni.",
    "thumb": "https://image.tmdb.org/t/p/w500/s9IaU4L7bu3W0CDw1gNielwal1d.jpg"
  },
  "S04E08": {
    "title": "Zhyň, blbče",
    "plot": "Richard a Emily mají velmi rozdílné názory na úspěch jejich služební cesty do Atlantic City; Rory, podněcovaná svým vydavatelem, napíše ostře vyhraněnou taneční recenzi, která vede ke konfrontaci s baletkou v jídelně; přestože Lorelai stále odolává jeho zájmu o ni, nemůže si pomoci, ale Jasonovy ladné pohyby na něj udělají dojem, když zmanipuluje mrazivou Emily, aby ho pozvala na páteční večeři a on se mohl dvořit Lorelai; Lane a Dave se na dálku pohádají kvůli keramice; Michel je zpět mezi zaměstnanci stále ještě rekonstruovaného hostince Vážka, ale kvůli jeho jedinému kýchnutí mu Bruce postaví zábrany, aby se zúčastnil schůzky zaměstnanců, na které je i přehnaně starostlivá novopečená matka Sookie a malý Davey; když se Lorelai dozví, že Nicole a Luke odložili svůj rozvod a znovu spolu začali chodit, je tak rozrušená, že se s Lukem pohádá.",
    "thumb": "https://image.tmdb.org/t/p/w500/bv0mJUvksIN1GDAf9S844tpzSPB.jpg"
  },
  "S04E09": {
    "title": "Velký zápas",
    "plot": "Rory a Paris obědvají na Yaleu s Richardem, který je seznámí se svým přítelem, profesorem Asherem Flemingem; během páteční večeře v rezidenci Gilmorových Lorelai žádá o pozvání na zápas Yale-Harvard, i když jí Rory dává jasně najevo, že je z toho venku; Emily je podrážděná, když se Lorelai objeví na zápase v barvách Harvardu; Gilmorovi se na zápase sejdou ve velkém stylu s placatkami, obytným autem, grilem a služebnictvem, které obsluhuje jejich hosty; Emily je naštvaná, když se objeví Pennilyn Lottová, Richardova první přítelkyně, a ptá se na hostinec, a Richard je nucen přiznat, že s Pennilyn chodil na půlroční večeři po celou dobu, co byli s Emily manželé; Lorelai přijme Jasonovu dřívější nabídku na večeři, ale nakonec opustí dusnou restauraci a skvěle se baví na čerstvém vzduchu v místním obchodě s potravinami; Rory se po zápase vrátí na kolej a zjistí, že se Paris líbá s Asherem Flemingem.",
    "thumb": "https://image.tmdb.org/t/p/w500/5PhZvFE6tfEo8PzOFdgE0y3R4CV.jpg"
  },
  "S04E10": {
    "title": "Profesor a chůva",
    "plot": "Luke je ohromen Laneinou pracovní morálkou, když ji najme na práci v bistru; Michel projevuje hlubokou žárlivost na Tobina; Emily a Richard zjišťují, že dobroty, které si přivezli ze Švýcarska, jsou všeobecně odmítány; Rory není z nového muže v Parisině životě příliš nadšená, zvláště když se dozví, že ji učí na hodinách současné politické beletrie; Lorelai a Jason se sbližují a ona ho prosí, aby jejich vztah před jejími rodiči tajil; Roryin talent pro návrhářství se snoubí s jejím talentem pro psaní, což jí vynese místo v \"Daily Yale\"; Sookie a Jackson nevysvětlitelně dovolí Michelovi hlídat Daveyho, což donutí Lorelai přijít na pomoc, když Michel, který nezklame, potřebuje dostat sebe a Daveyho z problému; Richard je silně podrážděný, když pěší výlet Chez Gilmore ve prospěch Historické společnosti přesáhne svou dobu.",
    "thumb": "https://image.tmdb.org/t/p/w500/e6KDNqyQpCq4ZgdTJVAwBo38Ec1.jpg"
  },
  "S04E11": {
    "title": "Za hlaholu zvoní",
    "plot": "Lane se vyplíží z domu, když Gil zařídí kapele koncert v 1:00 a.m v CBGB's. Luke a Lorelai berou věci do vlastních rukou, když se ukáže, že nově obnovené kostelní zvony nejsou tak vítané, jak se původně předpokládalo; Rory se během politické diskuse dostane do osobního vztahu s Williamem, když má podezření, že o ní šíří trapné historky; Lorelai je zpočátku rozrušená, když se dozví, že se Luke přestěhoval do Litchfieldu k Nicole, ale návštěva jeho bytu nad bistrem její obavy rozptýlí; Lane a její matka si dlouho odkládaný rozhovor s důsledky, které změní její život, po tom, co se paní Lorelai přestěhuje do Litchfieldu. Kim odhalí tajný život své dcery.",
    "thumb": "https://image.tmdb.org/t/p/w500/a4WrABYxdMqSwJTmQHpFstiwQMe.jpg"
  },
  "S04E12": {
    "title": "Rodinná záležitost",
    "plot": "Luke má plné ruce práce, protože se do Stars Hollow vracejí členové rodiny: Lorelai souhlasí, že bude Jasona doprovázet při ranním nákupu kancelářského nábytku, ale do cesty se mu stále staví zahraniční obchodní hovory; Jamie je ve městě a Paris se mu stále vyhýbá; Lorelai a Jason se shodnou, že Emily a Richardovi je třeba říct o jejich vztahu, ale Lorelai se k tomu prostě nemůže odhodlat poté, co se Emily vysmívá Jasonovi i myšlence, že by si někdy padl do oka s její dcerou; To, že Rory konečně řekla svůj názor na Parisiny milostné pletky, se jí vymstí, když se Paris rozhodne, že má budoucnost s Asherem, a rozejde se s Jamiem; Rory začne znepokojovat, že její matka má finanční problémy.",
    "thumb": "https://image.tmdb.org/t/p/w500/4nESp7uu9GQypCaQdb5CezijZ2Y.jpg"
  },
  "S04E13": {
    "title": "Ohňostroj a punč",
    "plot": "Jessova snaha držet se v ústraní, dokud Gypsy nedokončí opravu jeho auta, je vystavena zkoušce, protože neustále naráží na Roryho po celém městě; Taylor pověří Kirka vedením každoročního Festivalu ohňů a jeho manažerské schopnosti, respektive jejich nedostatek, způsobí, že přípravy budou náročné; Lane se vrací za Rory do Stars Hollow a na víkend si vybírá místo na gauči Gilmorových, ale není připravena čelit své matce; Emily je v rozpacích, jak obsadit stůl na benefiční akci, a požádá o pomoc Lorelai a Jasona, které povzbuzuje, aby předstírali, že jsou pár; Luke není příliš nadšený Liziným nejnovějším podnikatelským záměrem a jejím nově příchozím přítelem, což přiměje Jesse, aby strýčkovi vyčinil, že si má hledět svého; poté, co se Lorelai a Liz konečně setkají, získá Lorelai nový pohled na Luka; Lizini spolužáci ze střední školy se sjíždějí k jejímu bratrovi a odhalují, že jsou do něj dlouho zamilovaní.",
    "thumb": "https://image.tmdb.org/t/p/w500/5RURKaKUd3pZlk7rQCqd8rrr1AS.jpg"
  },
  "S04E14": {
    "title": "Lorelai volá S.O.S",
    "plot": "Když se Trix vrátí do města a vynadá Lorelai a Richardovi, že finančně selhávají, Richard k Emilyině radosti svou matku rozzlobeně vyvede z omylu; Lorelai a Sookie hledají způsoby, jak zmírnit finanční krizi a získat peníze na výplaty pro svou stavební partu, z níž jeden je nyní Dean; Janet a Paris se dohadují o neustálé přítomnosti Janetina přítele v apartmá; Lorelai a Rory hrají stále frustrující hru na honěnou; poté, co si Paris, Tanna a Janet stěžují na těsné sousedství v apartmá, se Lane stěhuje z koleje k Lorelai a získává zpět práci u Luka; Lorelai a Sookie vedou vášnivou diskusi o rozdělení odpovědnosti za otevření jejich hostince; Rory je rozrušená, když jí jeden z jejích profesorů řekne, aby zanechala výuky, protože nezvládá její zátěž.",
    "thumb": "https://image.tmdb.org/t/p/w500/uaoSFnoQAMcHy4lsVdahQSDseqf.jpg"
  },
  "S04E15": {
    "title": "Na nákupech",
    "plot": "Kirk se od hlídání psa Lulu vrhne na novou kariéru zaměřenou na psy; Paris se začne bát bakterií, když Rory dostane rýmu; Lane dostane byt se Zachem a Brianem a čelí chladnému přijetí od své tety a matky a příliš horlivému, neustále mluvícímu bratranci, když si sbalí věci a odstěhuje se; když si uvědomí, že jejich vztah se stále více odehrává přes e-mail a telefon, rozhodnou se Lorelai a Rory, že si udělají výlet a půjdou nakupovat do obchoďáku, kde narazí na Emily uprostřed nákupního kolapsu; Luke půjčí Lorelai třicet tisíc dolarů, které potřebuje na dokončení stavby hostince; poté, co Emily přizná, že nákupní horečka a hádky s Richardem pramení z jejího vzteku, že ji manžel ignoruje, zanedbává a dává jí pocítit, že je zbytečná, Lorelai ji ujistí, kolik toho dokázala, a naléhá na ni, aby si s Richardem promluvila, ale Emily se nedaří navázat s manželem spojení, po kterém tak zoufale touží.",
    "thumb": "https://image.tmdb.org/t/p/w500/pUkB41AzHSyWtqxsRFPEYaL9nBX.jpg"
  },
  "S04E16": {
    "title": "Kralující Lorelai",
    "plot": "Rozkol mezi Emily a Richardem se ještě prohloubí, když se vydá na golfovou schůzku s klienty, místo aby doprovodil svou ženu na pohřeb její nejlepší kamarádky; Doyle se pustí do krádeží a plagiátorství; Trix náhle zemře; Michel nabídne Lorelai objetí jako útěchu, což je natolik rozladí, že se dohodnou, že už nebudou sdílet žádné hřejivé chvíle; Richard je zasažen zármutkem a pocitem viny a je bezútěšný; Emily končí se zařizováním Trixina pohřbu a vše hodí do klína své dceři poté, co najde dopis, v němž tchyně prosí svého syna v předvečer jeho svatby s Emily, aby si vzal raději Pennilyn; Luke a Nicole mají celou Stars Hollow, která je poslouchá a odezírá jim ze rtů, když se hádají; Lorelai se bojí o své rodiče a šílí z toho, že musí splnit Trixiny náročné požadavky na její pohřeb, a zhroutí se při nakupování Trixina smutečního prádla.",
    "thumb": "https://image.tmdb.org/t/p/w500/tXdCrjJVLWngAZEJw1ao1kvNswP.jpg"
  },
  "S04E17": {
    "title": "Holky v bikinách, kluci na oprátce",
    "plot": "Rory, Paris, Janet a Glenn uniknou z dickensovsky chladné zimy v Connecticutu a vydají se na Floridu, kde narazí na Madeline a Louise, které jim ukážou, jak to chodí o jarních prázdninách; Jason dá Lorelai klíč od svého bytu jako symbol svého závazku k jejich vztahu; Lorelai vyplatí Luka z vězení poté, co je zatčen za to, že rozmlátil auto patřící muži, kterého podezřívá, že má poměr s Nicole; Lorelai a Rory se dostane pochybné cti poprvé se svézt v Kirkově nejnovějším podniku, pedikérské kabině ve Stars Hollow.",
    "thumb": "https://image.tmdb.org/t/p/w500/d3x6WkYrmulCP9VcfZbga3zbLXJ.jpg"
  },
  "S04E18": {
    "title": "Tik, tik, tik, bum!",
    "plot": "Luke se postará o větší rozruch než Davey, když Sookie a Jackson přivedou do bistra svého syna; celé Stars Hollow se pobaví, když se Taylor vrátí z plavby po Karibiku s drastickou změnou vzhledu; Richard a Emily jsou ohromeni, když jim Floyd oznámí, že Lorelai a Jason spolu už několik měsíců chodí; Luke přijde na pomoc, když Kirkovo selhání při sestavování mapy velikonočních vajíček, která ukryl na náměstí, vyvede Taylora z míry; Richard a Jason zjistí, že Floydovo smírné nadbíhání je jen zástěrkou pro jeho plán finančně zruinovat Richarda tím, že je zažaluje za krádež klientů; při nakupování s Lane v Doose's má Rory ostrá slova na adresu Lindsay, když vypráví o své hádce s Deanem kvůli jeho plánům nechat studia, aby si vydělal víc peněz na koupi domu, aniž by věděl, že jeho žena poslouchá ve vedlejší uličce; Richard řeší své problémy s Floydem na Jasonův úkor.",
    "thumb": "https://image.tmdb.org/t/p/w500/15bfWiLIK1KaOXrh7Lp9cDOYotA.jpg"
  },
  "S04E19": {
    "title": "Další rána",
    "plot": "Luke dokončuje svůj rozvod; poslední koncert kapely má velký úspěch, ale Lane se cítí osamělá; blíží se datum otevření hotelu Dragonfly Inn, Michel provádí cestovní kanceláře a Sookie je zpátky v kuchyni, když už ne na nohou; Doyle napoví Rory o Asherově pověsti sériového studijního nápadníka; Lorelai a Richard si vyříkávají účty kvůli jeho chování k Jasonovi; Lane je rozrušená, když zjistí, že její matka přijala korejskou studentku na výměnný pobyt, která by mohla být její dvojnicí, a konfrontuje dívku, když ji vidí v jejím starém oblečení; když se Jason rozhodne žalovat Richarda poté, co zjistí jeho zradu, Lorelai se s ním rozejde; Emily se obává, že Richardovo jednání vnese trhlinu do jejich vztahu s Lorelai a Rory, a žádá manžela, aby si to rozmyslel, ale ten ji odbyde; Asher je nespokojený, když se Rory ptá, zda \"jednička\", kterou jí dal za práci, kterou podle ní odevzdala špatně, má nějakou souvislost s jejím přátelstvím s Paris.",
    "thumb": "https://image.tmdb.org/t/p/w500/vEPS6AfNXyCgTrM90afKb4Q1Sij.jpg"
  },
  "S04E20": {
    "title": "Luke vidí její tvář",
    "plot": "Jacksonova oddanost jeho ženě a její slavná cuketová polévka připravují půdu pro dokonalý protijed proti stresu spojenému s otevřením hostince; Luke nevědomky přichází na pomoc, když se Sookie snaží dohodit Lorelai s dodavatelem drůbeže; Liz se vrací do Stars Hollow, aby oznámila, že se za týden bude vdávat na náměstí; Paris a Asher se rozhodnou, že během léta společně odcestují do Anglie; T.J. má bouřlivou rozlučku se svobodou; Jess si na Lukovu žádost rozmyslí účast na matčině svatbě a vrátí se na oslavu do Stars Hollow; Rory se snaží skrýt své rozladění, když jí Lorelai řekne o tom, že zaslechla hádku mezi Deanem a Lindsay; svépomocná kazeta pomůže Lukovi ujasnit si myšlení a rozhovor s Jessem ho přivede na cestu ke vztahu, který celou dobu hledal.",
    "thumb": "https://image.tmdb.org/t/p/w500/cWV10YKMEr5EOQ0nip4mLT58IS0.jpg"
  },
  "S04E21": {
    "title": "Nejdřív hádky, potom svátky",
    "plot": "Stars Hollow se připravuje na renesanční svatbu Liz a T.J., Kirk se cítí uražen, když slečna Patty vybere za kapitána tance na májce někoho jiného; Lorelai objeví v hale hotelu Dragonfly Inn koňského návštěvníka; Roryiny kamarádky z apartmá odjíždějí na letní prázdniny; Lorelai naléhá na paní Kim, aby zavolala Lane; Lorelai se během páteční večeře neúspěšně pokouší přimět Emily, aby se přiznala k odloučení; T.J. si libuje v zázracích punčocháčů, ale během obřadu zjistí jejich hlavní nevýhodu; paní Kimová se snaží, aby se Emily přiznala k odloučení. Kim dostane od Lorelai několik dobrých rad poté, co zpočátku zděšeně prchá při pohledu na Zachův, Brianův a Lanein ošuntělý byt, a nakonec se vrátí na čaj vyzbrojena plánem hry; Rory zavolá Deanovi, aby ji zachránil před katastrofálním rande, které jí Emily domluvila se synem kamarádky; Luke a Lorelai se během pomalého tance na svatbě významně podívají, což Luka přiměje pozvat Lorelai na rande; Jess před rozloučením vyjádří Lukovi vděčnost.",
    "thumb": "https://image.tmdb.org/t/p/w500/9tqNMRZBJRUf61lpMOjPOfUWtGE.jpg"
  },
  "S04E22": {
    "title": "Generálka",
    "plot": "Ve vzduchu se odehrávají zásadní změny: hostinec Dragonfly se blíží ke dni otevření a pořádá víkendovou prohlídku; Rory a Dean udělají k Lorelaině zděšení velký krok vpřed ve svém vztahu; Emily a Richard přiznávají, že žijí odděleně; Kirk se rozhodne zasvětit Lulu do hlubokého, temného tajemství svých nočních děsů; Jason se objeví v hostinci, aby se Lorelai bezvýsledně zastal; Luke odpoví na Lorelainu otázku ohledně stavu jejich vztahu, když jí vášnivě dá najevo, že spolu chodí, s čímž ona nadšeně souhlasí.",
    "thumb": "https://image.tmdb.org/t/p/w500/15BTqk1wxxxLHwCHfsDzMLbnKNw.jpg"
  },
  "S05E01": {
    "title": "Láska si nevybírá",
    "plot": "Mezi Lorelai a Rory to stále skřípe a Roryino odmítání mluvit o situaci s Deanem způsobuje Lorelai úzkost; Emily oznámí, že se s Richardem rozešli; Sookie je nadšená, když jí Kirk řekne, že se Luke a Lorelai políbili; Roryin pokus setkat se s Deanem a probrat s ním, co se stalo, vede ke spoustě akcí, ale k žádnému rozhovoru; Dean po odchodu z Roryina domu vyprovokuje hádku s Lindsay; Emily se rozhodne odjet do Evropy a pozve Rory, aby ji doprovodila; Lorelai a Luke se k sobě druhý den chovají velmi nejistě, dokud se navzájem neujistí, že jsou na správné cestě; Luke odjíždí na týden do Maine, aby pomohl Liz a T. J. s jejich stánkem na Ren Faire; Rory se rozhodne, že si potřebuje odpočinout od Deana i od matky, a rozhodne se přijmout pozvání své babičky do Evropy.",
    "thumb": "https://image.tmdb.org/t/p/w500/2YACSMshM3YcJBrBpidkzMupdN7.jpg"
  },
  "S05E02": {
    "title": "Návraty domů",
    "plot": "Luke se rozhodne, že po sedmi týdnech na Ren Faire je čas vrátit se domů; Rory se volá, aby se omluvila a požádala matku, aby doručila dopis Deanovi; Sookie přesně diagnostikuje Lorelai těžký případ manažerského vyhoření a obě kamarádky se rozhodnou odreagovat se dámskou jízdou; Emily a Rory se vracejí domů vyčerpané z toho, jak odrážely pozornost náruživých evropských mužů; Michel je divoce nenadšený, když je dotlačen k hlídání hostů, jejichž děti si ho nevysvětlitelně oblíbily; poté, co Lindsay najde Roryin dopis, vyhodí Deana i se vším jeho majetkem z domu a její matka se na náměstí rozzlobeně střetne s Lorelai; Lane si uvědomí, že se zamilovala do Zacka; Rory je zarmoucena, když Dean vyjádří lítost nad změnou v jejich vztahu a nad tím, jak to ublížilo jeho ženě a jejich rodinám.",
    "thumb": "https://image.tmdb.org/t/p/w500/8VTRjTGyI6ikDnZaYl91kQRbjer.jpg"
  },
  "S05E03": {
    "title": "Psáno ve hvězdách",
    "plot": "Luke a Lorelai jdou na své první oficiální rande do restaurace, kterou vlastní staří přátelé Lukových rodičů. Luke Lorelai připomene, jak se seznámili, ukáže jí horoskop, který mu dala pro štěstí a který má uložený v peněžence, a ujistí ji, že s ní hodlá jít na věc. Lorelai stráví noc u Luka, ráno si zajde do bistra pro kávu a při snídani ji uvidí jen v Lukově košili. O Lukovi a Lorelai se překvapivě málo mluví až do další městské schůze, kde Taylor pomocí grafů ukazuje, jak katastrofální by byl pro Stars Hollow jejich rozchod. Mezitím: Rory se seznámí s bohatým studentem z Yale jménem Logan a vynadá mu za to, že se choval hrubě k její kamarádce Marty; Paris pořádá smuteční hostinu za Ashera, o které se všichni hosté domnívají, že je to sudová párty s podivným tématem; a Emily se vyděsí, když zjistí, že Richard vede společenský život, o kterém neví, a tak během smuteční hostiny vtrhne na Roryinu kolej.",
    "thumb": "https://image.tmdb.org/t/p/w500/xVf2ikA3qE3tTNBNNdTlEnJaTkX.jpg"
  },
  "S05E04": {
    "title": "Vzpoura proti Taylorovi",
    "plot": "Lorelai se přizná, že součástí kouzla snídaně u Luka je snídaně u Luka; Rory není příliš nadšená, když zjistí, že společenskou místnost v jejím apartmá ovládl obrovský starožitný tiskařský lis, který Paris zdědila po Asherovi; Lorelai a Sookie vedou Jacksonův volební výbor, když se rozhodne kandidovat proti Taylorovi na post městského zastupitele, aby skoncoval s malomyslnou tyranií prodavače potravin nad Stars Hollow, ale Lorelai si to rozmyslí, když vidí, jak Jacksonovo předpokládané drtivé vítězství ovlivňuje Taylora; Rory a Dean mají potíže najít příjemné místo, kde by mohli být sami, což je umocněno tím, že Dean musí sdílet auto s Lindsay a že se zdráhá zveřejnit svůj vztah s Rory; Lane se přizná Zackovi ke svým skutečným citům; po sečtení všech hlasů si Jackson není tak docela jistý, že chce funkci, a Taylor přísahá, že neodejde potichu.",
    "thumb": "https://image.tmdb.org/t/p/w500/imPNQrFa5V1taOiQmBj47sf5YwQ.jpg"
  },
  "S05E05": {
    "title": "Rande ve čtyřech",
    "plot": "Požadavky voličů začínají na Jacksona doléhat; Lorelai a Rory jemně sbližují Richarda a Emily; Lorelai se rozhodne, že dvojité rande s Rory a Deanem je způsob, jak urovnat problémy ve vztahu s Deanem, ale večer se zvrtne, když Luke nedokáže překonat pocit, že Dean není pro Rory dost dobrý; Richard se věnuje novému koníčku a Emily si koupí panickou místnost; když se jí nepodaří získat od Zacka odpověď na vyznání svých citů, Lane je odvolá, což Zacka konečně přiměje k rozhovoru; Lorelai seznámí Luka s \"\"Pipi Dlouhou punčochou\"\", zatímco Kirk se během filmového večera v knihkupectví Black & White & Read mnohem lépe seznámí s Lulu.",
    "thumb": "https://image.tmdb.org/t/p/w500/b4TSvNG4iDJoa11R5F13lJGf6YM.jpg"
  },
  "S05E06": {
    "title": "Drž se svého instinktu",
    "plot": "Danny žárlí, když Glennův článek převezmou New York Times; Rory zjistí, že Logan, syn novinového magnáta, je také zaměstnancem novin; Paris vede zuřivou kampaň za získání náboženské rubriky a zaujme ekumenický přístup, aby si znepřátelila místní duchovní; Rory zoufale hledá nápad na článek, když se jí nepodaří několik konceptů, a odhalí tajný spolek Yale, jehož členem je i Logan, a požádá ho o spolupráci, aby o skupině napsal článek; Sookie se rozčílí, když účetní hostince navrhne dočasně zrušit obědy, aby se ušetřilo, a Norman Mailer si v jídelně vyhradí stůl, aby mohl pracovat a poskytovat rozhovory, a odmítne si objednat cokoli z jídelního lístku kromě ledového čaje; Lorelai a Rory se objeví na páteční večeři, a když zjistí, že Emily ani Richard nejsou doma, rozhodnou se objednat pizzu a jíst na podlaze v obývacím pokoji.",
    "thumb": "https://image.tmdb.org/t/p/w500/cIOehhPgE1sU8ILtmwDQBquOTna.jpg"
  },
  "S05E07": {
    "title": "Skok do neznáma",
    "plot": "Poté, co Kirk prozradí, že její dcera chodí s Lukem, Emily požaduje, aby ho Lorelai vzala na večeři, aby se mohli znovu seznámit; ačkoli se ho Lorelai snaží varovat, Luke stejně jde a je vystaven večeru plnému urážek od pasivně agresivní Emily; poté, co Zach oznámí, že je připraven začít chodit s Lane, stráví první rande doma poté, co vykázal Briana do Laneiny ložnice; Luke, který se nepoučil z Emily, souhlasí, že přijme Richardovo pozvání na golf, a oba muži nedbají na Lorelainy prosby, aby to zrušili; Rory se dozví svůj příběh o \"\"Brigádě na život a na smrt\"\", když jí Logan a jeho přátelé zavážou oči a odvedou ji, aby sledovala důmyslně zinscenovaný víkend v lese, a nakonec, poté co ji Logan povzbudí, aby riskovala, se zúčastní dechberoucího finále akce.",
    "thumb": "https://image.tmdb.org/t/p/w500/5o9mHGl4dwumiS9iuYnchJ2HgA3.jpg"
  },
  "S05E08": {
    "title": "A je po večírku",
    "plot": "Poté, co Emily zjistí, že se Rory opět stýká s Deanem, uzavře s Richardem dočasné příměří, aby mohli společně uspořádat večírek absolventů Yale, jehož cílem je najít vhodného partnera pro jejich nic netušící vnučku; Liz a T.J. si koupí dům ve Stars Hollow; paní Kimová vyletí z kůže poté, co jí Kyon řekne, že se Lane a Zach objímali v Lukově bistru; když se Liz a T.J. pod tlakem nového bydlení pohádají, T.J. hledá útočiště u svého švagra a zničí romantickou večeři a večer, které Luke připravil pro Lorelai; Logan se objeví na večírku právě včas, aby zachránil Rory před dalším potenciálním ženichem, a Rory se dozví, že se velmi dobře zná s jejími prarodiči; Lane přivede Kyona na temnou stranu kulinářství a prozradí mu tajemství šťastného života teenagerů v domě Kimových; Dean si uvědomí, že už nezapadá do Roryina života, a Logan galantně zakročí, aby jí osušil slzy.",
    "thumb": "https://image.tmdb.org/t/p/w500/zajuYxryOOMWS4JI9g31nvUg37g.jpg"
  },
  "S05E09": {
    "title": "Emily má rande",
    "plot": "Jackson je trpělivý, zatímco Sookie trpí výkyvy nálad a těhotenskými chutěmi na jídlo; Parisino rozhodnutí postit se ramadán, aby její psaní bylo autentické, si vybírá daň u Rory a Martyho; Michel navzdory Lorelaině radě vytrvale pokračuje ve svém plánu překazit bandity v županu a málem se nechá zatknout; Emily se rozhodne znovu začít chodit s někým a požádá o radu neochotnou Lorelai; Jackson je natolik zavalen svými povinnostmi volitele, že je slečna Patty nucena uchýlit se k lsti, aby ho přiměla předsedat městské schůzi; Lorelai pozve Christophera na oběd do hostince a rozhodne se překvapit Rory tím, že ji pozve také, ale je to Lorelai, kdo je překvapen napětím mezi otcem a dcerou, které mimo Lorelaino doslechnutí vyústí v prudkou hádku; Lorelai se cítí provinile, že lhala Rory, když se jí dcera zeptá na Lukovu reakci na schůzku s Christopherem; Luke pomáhá T. J. s nějakými problémy s instalatérskými rozvody v novém domě.",
    "thumb": "https://image.tmdb.org/t/p/w500/2dSYqIzpV6ve27ghytNqyRzOQEa.jpg"
  },
  "S05E10": {
    "title": "Už zase další výročí",
    "plot": "Slečna Patty slaví čtyřicet let v showbyznysu ve stejný den, kdy Luke truchlí nad smrtí svého otce; Terrencovo naléhání na Paris, aby pokračovala ve svém životě, ji přiměje zkusit rychlé rande, kde se dá dohromady s Doylem; Marty konečně Rory prozradí, že on i Logan o ni mají zájem; Lorelain pokus udělat něco hezkého pro Luka se zvrtne; Rory přiměje Richarda, aby obrátil žertík proti Loganovi; na žádost ředitele Charlestona Rory s radostí provede Annu, studentku Chiltonu a budoucí Eli, po Yaleu, ale nedospělá Anna dokáže dostat do problémů sebe i svého hostitele svými večírky.",
    "thumb": "https://image.tmdb.org/t/p/w500/1lrbq1GsFllOkoZnvoSg2P0GhKV.jpg"
  },
  "S05E11": {
    "title": "Ženy lehkých mravů",
    "plot": "Christopher se chce s Rory usmířit a objeví se na Yale, ale ona jeho pokus o kompromis odmítne. Když se Lorelai dozví, že Christopherův otec zemřel, stráví večer u něj a snaží se ho utěšit, pak pohrdavě řekne Lukovi pravdu o tom, kde byla. Také Emily a Richard se nakrátko usmíří, když najdou a ujmou se ztraceného psa.",
    "thumb": "https://image.tmdb.org/t/p/w500/ddtIui5gBTiw6Jz0gZuq37qXQsZ.jpg"
  },
  "S05E12": {
    "title": "Návrat domů",
    "plot": "Rory nabídne Loganovi pomoc při psaní článku do Yale Daily, ale je zklamaná, když ji nepozve na autogramiádu, kterou pořádá jeho otec. Když Richard vidí Emily, jak se baví s mužem, s nímž chodila, nabourá jí do auta a donutí ji, aby s ním jela domů. Gilmorovi se usmíří a rozhodnou se obnovit svůj svatební slib. Emily varuje Christophera, že to Lorelai a Luke začínají brát vážně a že by měl rychle něco udělat, pokud doufá, že skončí s Lorelai.",
    "thumb": "https://image.tmdb.org/t/p/w500/6MOinMlDkh3bpTlgQTEow3eWF1Z.jpg"
  },
  "S05E13": {
    "title": "Blues svatebních zvonů",
    "plot": "Emily a Richard obnoví svůj slib před zraky stovky svých nejbližších přátel, Lorelai jde Emily za družičku a Rory Richardovi za svědka. Luke se kvůli Lorelai pohádá s Christopherem. Logan přijde na obřad s dívkou, která vypadá jako jeho přítelkyně, a Rory začne žárlit. Rory konfrontuje Logana a Logan s Rory přejdou od flirtování o úroveň výš.",
    "thumb": "https://image.tmdb.org/t/p/w500/zBeC2603opvUnCHwIHVZZbHXGUr.jpg"
  },
  "S05E14": {
    "title": "Tak řekni něco",
    "plot": "Lorelai se ze všech sil snaží přimět Luka, aby to s nimi po hrozných událostech na svatbě nevzdával. Luke jí řekne, že potřebuje trochu času, a Lorelai to nevydrží. Rory požádá Logana, aby si s ní vyrazil, ale je naštvaná, že když k němu přijde, je tam spousta lidí. Zavolá jí Sookie, která jí řekne, že Lorelai je na tom špatně poté, co jí Luke řekl, že si myslí, že v tomhle vztahu nemůže být. Rory nemá auto, ale Logan jí půjčí své auto i s řidičem. Taylor přiměje celé město, aby se postavilo buď na stranu Luka, nebo Lorelai. Poté, co se postará o svou matku, se Rory vrací na Yale, aby si to s Loganem vyříkala, a ujistí se, že pochopil, že to vysedávání neznamená jen vysedávání, ale i čas o samotě.",
    "thumb": "https://image.tmdb.org/t/p/w500/kI6LPhSFMmeNZ41REJ7p2yCSl3j.jpg"
  },
  "S05E15": {
    "title": "Židé a čínská kuchyně",
    "plot": "Lorelai, která se stále trápí rozchodem s Lukem, je ještě více zasažena, když si všimne, že Luke přestěhoval svou loď. Mezitím se Luke přihlásí jako dobrovolník na stavbu kulis pro školní představení \"Šumař na střeše\", protože ví, že Lorelai dělá kostýmy, a doufá, že se jejich cesty zkříží. Mezitím se na Yale Rory plánuje znovu setkat s Martym (Wayne Wilcox) a sledovat filmy bratří Marxů, ale Logan jim překazí den a pozve je na večeři se svou skupinou.",
    "thumb": "https://image.tmdb.org/t/p/w500/2BeQqRMpDjc1nLAcWDDXN5dbZi1.jpg"
  },
  "S05E16": {
    "title": "Láska hory přenáší",
    "plot": "Když se Richard a Emily vrátí ze svých druhých líbánek, Rory se zúčastní páteční večeře bez Lorelai, která odmítá s matkou mluvit nebo ji vidět, a místo toho si naplánuje dámskou jízdu se Sookie. Richard a Emily pak dají Rory sto let starou řeckou knihu a mají další služebnou. Rory všechny překvapí vzácným výbuchem na svou babičku za to, že se plete do Lorelaina milostného života. Mezitím si Luke, který je bez Lorelai nešťastný, vybíjí zlost na zákaznících a jeho černá nálada způsobí, že připálí jídlo, a když chce jeden zákazník předělat omeletu, vyhodí ho z bistra. Když taxikářka vypisuje pokutu, kterou má dát na Lukův člun (který parkuje před bistrem), Lorelai přijde včas, aby do taxametru vhodila čtvrťáky. Emily si jde do bistra promluvit s Lukem. Lane si mezitím strašlivě uvědomí matčinu nevraživost.",
    "thumb": "https://image.tmdb.org/t/p/w500/5AF9ztyFc57nnTgc5BORn9irzb7.jpg"
  },
  "S05E17": {
    "title": "Vítězové a poražení",
    "plot": "Teď, když jsou Luke a Lorelai zase spolu, může Lorelai přijít do bistra a přidá se na Lukovu rychlou volbu. Domluví si na neděli schůzku, aby oslavili, že se k sobě vrátili. Kirk se mezitím usadil v bistru a sbírá růžové a modré stužky, které nosili občané Stars Hollow. Rory a Logan spolu stále chodí, ne však výhradně. Rory a Lorelai ho vidí s jinou dívkou, když nakupují v centru New Havenu. Lorelai chce jít za Loganem a křičet na něj, ale Rory ji informuje, že je to v pořádku - i když se netváří, jako by si to opravdu myslela. Řekne Lorelai, že spolu jen chodí a smí se stýkat s jinými lidmi. Emily a Richard předpokládají, že když Emily dala Lukovi pokyn, aby se k Lorelai vrátil, musí být teď všechno v pořádku. Jsou však překvapeni, když vidí, že na páteční večeři přišla jen Rory.",
    "thumb": "https://image.tmdb.org/t/p/w500/h7INxDYsCirXkcdhtlgaM4fbFOM.jpg"
  },
  "S05E18": {
    "title": "Dědictví po starém Twickhamovi",
    "plot": "Starý pán Twickham umírá a v závěti prohlašuje, že dům bude na dva měsíce přeměněn na muzeum a poté bude zlikvidován šéfem historické společnosti Taylorem. K velkému překvapení všech se Luke přihlásí jako dobrovolník, aby pomohl s muzeem a zůstal tak blízko domu; Lorelai je díky svému úspěchu s hostincem vyzpovídána v časopise; Lane podezřívá Zacha, že ji podvádí se Sophií; Rory a Paris trucují nad svými nedávnými nástrahami v lásce, které vyústily v to, že se oba ve Stars Hollow opíjejí s Lane na punči slečny Patty a všichni tři se snaží kontaktovat své manžele; Dean informuje Luka, že jejich situace je stejná a že Lorelai se nakonec začne nudit a půjde dál; Lane zjistí, že Zach tajně cvičí v bluegrassové kapele.",
    "thumb": "https://image.tmdb.org/t/p/w500/hm4izpO3IP7mvKskrVyJwEcHI5F.jpg"
  },
  "S05E19": {
    "title": "Ale já jsem Gilmorová",
    "plot": "Rory si konečně uvědomí, že není náhodná milenka, a řekne Loganovi, že chce být kamarádka. On ji překvapí tím, že jí navrhne, aby se místo toho stali párem; zatímco jí tento plán rozhodně nevadí, jeho rodině možná ano. Luke zaskakuje jako šéfkuchař v restauraci Vážka, zatímco Lorelai hledá dočasnou náhradu za Sookie, která musí zůstat po zbytek těhotenství na lůžku. Bohužel se Sookie nelíbí, že ztrácí kontrolu nad kuchyní, a zasahuje do Lukova jednání. A Paris se dozvídá pravý důvod, proč jí Doyle v poslední době nebere telefon.",
    "thumb": "https://image.tmdb.org/t/p/w500/pwhzv4yT0m1H1C2B6P1oO15CNic.jpg"
  },
  "S05E20": {
    "title": "Návštěva u Emily a Richarda",
    "plot": "Rory nastoupí na stáž; kvůli nízké návštěvnosti a k Lukově radosti se Taylor rozhodne zavřít muzeum a prodat dům; Richard a Emily pozvou Logana na večeři a Lorelai prosí o účast; Lorelai se setká s investorem do hotelu, což by mohlo v budoucnu znamenat cestování.",
    "thumb": "https://image.tmdb.org/t/p/w500/wXSvT3DhUIbY9PpsmhoTaKAh74D.jpg"
  },
  "S05E21": {
    "title": "Nepříjemné překvapení",
    "plot": "Vyjde časopis a Luke a Lorelai se při oslavách příliš rozvášní; Sookie začne rodit; Rory dostane překvapivou recenzi od Mitchuma Huntzbergera a jde do krajnosti, aby se odreagovala; Luke je rozrušený, když zjistí, že Kirk podal konkurenční nabídku na dům Twickhamových; Emily přijme zahraniční baletku.",
    "thumb": "https://image.tmdb.org/t/p/w500/sieUzFYTGcEXYMzvdWJk8l7AgK8.jpg"
  },
  "S05E22": {
    "title": "Dům neznamená domov",
    "plot": "Lorelai vyzvedne Rory z policejní stanice a odveze ji domů. Rory jí vysvětlí, že krádež lodi nebyl Loganův nápad a Lorelai by mu to neměla vyčítat. Logan zjistí, že jeho otec Rory rozrušil, a řekne, že si s otcem promluví, ale Rory ho prosí, aby to nedělal. Rory se rozhodne, že se příští rok na Yale nevrátí. Lorelai se tento nápad nelíbí a jde si pro pomoc k rodičům. Rory se nastěhuje k Richardovi a Emily. Seriál končí žádostí o ruku.",
    "thumb": "https://image.tmdb.org/t/p/w500/bmJiZYM3jf8669KPmGkwmMaF4Yb.jpg"
  },
  "S06E01": {
    "title": "Nová a vylepšená Lorelai",
    "plot": "Luke odpoví na Lorelainu otázku, a když zpráva o Lukově odpovědi pronikne mezi obyvatele Stars Hollow, netradiční návrh vzbudí větší pozornost než samotná odpověď. Richard a jeho právník se u soudu zastávají Rory kvůli jejímu incidentu na jachtě, ale soudce je přísnější, než čekal.",
    "thumb": "https://image.tmdb.org/t/p/w500/sI7XgUdGfMECoc6hGAmlOKSublp.jpg"
  },
  "S06E02": {
    "title": "Bojechtivý výraz",
    "plot": "Lorelai se cítí trochu osamělá a adoptuje si psa. Luke souhlasí, že opraví Lorelain dům, místo aby koupil dům Twykhamových. To se brzy změní v problém, protože TJ provádí na domě nechtěné stavební úpravy. Rory začíná vykonávat veřejně prospěšné práce. Rory se cítí zanedbávaná a nespokojená s tím, jak se věci vyvíjejí, a navštíví Luka v jeho bistru. Ten se nechá slyšet, že je s Lorelai zasnoubený, a Rory se tak cítí ještě osamělejší.",
    "thumb": "https://image.tmdb.org/t/p/w500/99vMHcatdx7WY16cpUpnPfJMNWC.jpg"
  },
  "S06E03": {
    "title": "Přerušené studium",
    "plot": "Sookie vytvoří svatební dort S'mores, takže co víc Lorelai potřebuje, aby si domluvila rande? Logan se vrací domů, Lane s kapelou se vrací domů a Paul Anka sní tři kila čokolády, zatímco je v Lukově péči.",
    "thumb": "https://image.tmdb.org/t/p/w500/uzh6XRVNyYF1AcjR683te2U1o2m.jpg"
  },
  "S06E04": {
    "title": "Není kmotra jako kmotra",
    "plot": "Po měsících odloučení se Sookie snaží usmířit Rory a Lorelai tím, že je požádá, aby se staly kmotrami jejích dvou dětí. Obě se však nakonec pohádají, když Lorelai zjistí, že Rory nepovažovala za vhodné sdělit jí své nové telefonní číslo.",
    "thumb": "https://image.tmdb.org/t/p/w500/gWo3Fpq86BWxyEL3zaHBWvBlsww.jpg"
  },
  "S06E05": {
    "title": "Musíme udělat kouzlo",
    "plot": "Lorelai potřebuje Richardovu pomoc s pojištěním po malém požáru v hostinci Dragonfly Inn a využije příležitosti, aby si s ním promluvila o tom, že se mu nepodařilo dostat Rory zpět na Yale. Ačkoli se mu Lorelaina výtka nelíbí, Richard musí uznat, že Rory není tam, kde by měla být.\n\nMezitím Rory uspořádá pro Emily báječný večírek D.A.R., ale večer se nevydaří, když Richard konfrontuje Mitchuma Huntzbergera, Loganova otce, s jeho názorem na Roryin novinářský talent.",
    "thumb": "https://image.tmdb.org/t/p/w500/ptsIGv8lIN7XXBwoikRN8mnnFDX.jpg"
  },
  "S06E06": {
    "title": "Vítejte v domě panenek",
    "plot": "Poté, co se Richard v rozhovoru s Loganem snaží zjistit, jaké jsou Roryiny plány do budoucna, nakonec uzná, že udělal chybu, když nechal Rory odejít z Yale, a přijde za Lorelai, aby našli řešení. Logan se však mylně domnívá, že Richard chce vědět, kdy se plánují vzít. Také Rory učiní Loganovi velké prohlášení; Taylor dostane ve Stars Hollow zabrat, když se rozhodne změnit všechny názvy ulic zpět na jejich historické názvy. Nápad, který se nelíbí Lorelai, když si uvědomí, jak se dříve jmenovala ulice, kde se nachází hostinec Vážka.",
    "thumb": "https://image.tmdb.org/t/p/w500/z1wMCZhymdFOVESJMQw7fXxoudY.jpg"
  },
  "S06E07": {
    "title": "Jednadvacet je to nejsmutnější číslo",
    "plot": "Lorelai odmítá poslouchat Richardův plán, jak Rory uplatit, aby se vrátila do školy, a tvrdí, že Rory se musí chtít vrátit sama. Rory i Lorelai jsou smutné z toho, že je jejich odcizení drží od sebe v den Roryiných 21. narozenin. Emily se ujímá naplánování oslavy pro svou vnučku, když Rory o akci nejeví zájem. Richard a Emily zjistí, že Rory a Logan spolu spí. Lorelai se snaží přesvědčit Luka, aby se zúčastnil její halloweenské scénky o šíleném vědci.",
    "thumb": "https://image.tmdb.org/t/p/w500/clQQKetbqbYvm3v63jtlssKjrRX.jpg"
  },
  "S06E08": {
    "title": "Ať mi zahraje tvá balalajka",
    "plot": "Rory je příjemně překvapena, když se v domě jejích prarodičů objeví její dávná láska Jess a odhalí úžasný vývoj ve svém životě. Rory souhlasí, že s Jessem půjde na večeři, a když se k nim nečekaně připojí Logan, dojde k ošklivé konfrontaci, při níž Rory i Logan musí čelit rozhodnutím, která učinili. Emily je znepokojena Roryinou náhlou vyhýbavostí a snaží se uplatnit rodičovskou disciplínu. Mezitím Luke souhlasí se sponzorováním místního dívčího fotbalového týmu a Lorelai všechny své obavy o Rory přesměruje do péče o svého psa Paula Anku.",
    "thumb": "https://image.tmdb.org/t/p/w500/oa9aLIZnF3wsAaoQqFHSRLQE3ZF.jpg"
  },
  "S06E09": {
    "title": "Návrat ztracené dcery",
    "plot": "Luke oslavuje dokončení domu. Rory nevychází s babičkou a nastěhuje se k Lane.",
    "thumb": "https://image.tmdb.org/t/p/w500/5A0quOVfgcm7I97a0FunvoczykD.jpg"
  },
  "S06E10": {
    "title": "Otcové a dcery",
    "plot": "Po dlouhé nepřítomnosti se Christopher znovu objeví v životě Lorelai a Rory. Luke bojuje s tím, co pro něj a jeho vztah s Lorelai bude nový člověk v jeho životě znamenat. Lorelai a Rory si užijí první Díkůvzdání v hostinci U vážky a Rory se dozví překvapivou zprávu o Loganovi. Mezitím se Lane v předvečer důležitého koncertu kapely musí vypořádat se Zachovou žárlivostí na píseň, kterou o ní Brian napsal.",
    "thumb": "https://image.tmdb.org/t/p/w500/qdfeeBZVWTKV6XR37Uo3QbhrrEk.jpg"
  },
  "S06E11": {
    "title": "Perfektní šaty",
    "plot": "Perfektní šaty: elegantní hedvábný styl, ve velikosti Lorelai a ve slevě - ideální na svatbu. Dokonalý nepořádek: Lane, vznětlivá, bojovná a nešťastná od té doby, co se rozešla se Zachem a vrátila se domů.",
    "thumb": "https://image.tmdb.org/t/p/w500/jjKynGxhXFZ1HmV9cvxtXKMHdDL.jpg"
  },
  "S06E12": {
    "title": "Jako Gwen a Gavin",
    "plot": "Během noci je svolána mimořádná schůze města, protože se Taylor nestihne vrátit na zimní festival. Logan naléhá na Rory a posílá jí spoustu květin a dárků. Luke se snaží sblížit se svojí dcerou, o které zatím neřekl Lorelai.",
    "thumb": "https://image.tmdb.org/t/p/w500/1LiQAuH6enXbh6rv2w66lBjjJcg.jpg"
  },
  "S06E13": {
    "title": "Páteční večer je stvořený pro hádky",
    "plot": "Lorelai se chová podivně potom, co se dozví o Lukově dceři a odložení svatby. Rory souhlasí se schůzkou s Loganem. Emily a Richard se dozví o změně ohledně Roryina školného.",
    "thumb": "https://image.tmdb.org/t/p/w500/AqffYc8tVP9zvnNUHpWaW2Sc2c7.jpg"
  },
  "S06E14": {
    "title": "Gilmorování",
    "plot": "Emily řekne Lorelai, že by ráda lépe poznala svého budoucího zetě, a požádá ji, aby pozvala Luka na večeři - Lorelai se záměrně nezmíní, že svatba byla odložena... Zaměstnanci Yale Daily News nakonec vyhodí Parise a vyberou Rory jako novou redaktorku. Rozzuřený Paris vyhodí Rory z bytu, Logan ji následně přesvědčí, aby se nastěhovala k němu. Christopher řekne Lorelai o Roryině novém bydlení.",
    "thumb": "https://image.tmdb.org/t/p/w500/amvaEbAVIv9TcaWbYhw5wpZ9udg.jpg"
  },
  "S06E15": {
    "title": "Valentýn na Vineyardu",
    "plot": "Blíží se Valentýn a Rory s Loganem pozvou Lorelai a Luka, aby s nimi strávili víkend v domě Loganovy rodiny na Martha's Vineyard. Lorelai je rozrušená Lukovým nepřátelským postojem k Loganovi. Lukeův postoj se změní, když si uvědomí, že zapomněl koupit Lorelai valentýnský dárek, a Logan zachrání situaci. Když se Lorelai Lukovi konečně svěří, že se obává, že se svatba nikdy neuskuteční, ujistí ji, že se brzy vezmou. Víkend končí ošklivou scénou, když přijede Loganův otec Mitchum Huntzberger.",
    "thumb": "https://image.tmdb.org/t/p/w500/2uHzofWhzmRmlbJfoqPYIU6AG11.jpg"
  },
  "S06E16": {
    "title": "Co družičky vyprávěly",
    "plot": "Lorelai nabídne Christopherovi pomoc a pohlídá jeho čtyřletou dceru G.G., ale je zděšena hrozným chováním batolete. Další den se Rory a Logan zúčastní svatby Loganovy sestry Honor. Zatímco pomáhají nevěstě a jejím třem družičkám s přípravou, Rory je zdrcená, když se dozví, jak Logan trávil čas během jejich nedávného rozchodu.",
    "thumb": "https://image.tmdb.org/t/p/w500/5kt8zlOCMZskgNmlXBpa00JkCxA.jpg"
  },
  "S06E17": {
    "title": "Já jsem OK, ty jsi OK",
    "plot": "Rory Loganovi odpustí, ale pak potřebuje čas pro sebe, a tak navštíví Lorelai ve Stars Hollow. Ačkoli Lorelai odmítá přiznat, že je rozrušená, Rory pozná, že ji trápí zpráva, že Luke odjede na několik dní na výlet se svou dcerou April. A proti Lorelaině vůli Rory navštíví obchod, který vlastní Aprilina matka Ana, aby ji špehovala. Mezitím, když Zack konečně sebere odvahu a požádá paní Kim o svolení vzít si Lane, je překvapen dohodou, kterou s ním uzavře.",
    "thumb": "https://image.tmdb.org/t/p/w500/q7pMmljfhvdQjWkcgdQiflz6U1o.jpg"
  },
  "S06E18": {
    "title": "Skutečný Paul Anka",
    "plot": "Lorelai se zdál podivný sen ohledně skutečného Paula Anky. Luke vyráží na výlet s April a Luke přenechává bistro Caesarovi.",
    "thumb": "https://image.tmdb.org/t/p/w500/dgxJEi5aoyiCPrXMYvQg6i8yqvm.jpg"
  },
  "S06E19": {
    "title": "Svatba po korejsku",
    "plot": "Blíží se svatba Lane a Zacka, a protože Luke je zaneprázdněný, je Michel první volbou Lorelai jako partner na svatbu Lane a Zacka, ale dostane lístky na Celine Dion a odejde. Rory navrhne, aby šel Chris jako Lorelain doprovod, a Chris je naprosto nadšený, že to udělá. Babička Kim je buddhistka a neví, že paní Kim je adventistka sedmého dne. Na Laneině svatbě Lorelai zkolabuje a Christopher se o ni postará.",
    "thumb": "https://image.tmdb.org/t/p/w500/kQ91UDISOo0sFbe7FOfn74ay1Ho.jpg"
  },
  "S06E20": {
    "title": "Super senza párty parta",
    "plot": "Lorelai se trápí po scéně, kterou vyvedla na Lanině svatbě. Rory se vydala do nemocnice navštívit Logana. Luka překvapí jak se Lorelai snaží sblížit se svojí dcerou zatímco se snaží zachránit její narozeninovou párty.",
    "thumb": "https://image.tmdb.org/t/p/w500/1NxLy6loypj0HnZFBuHzWOZL9tD.jpg"
  },
  "S06E21": {
    "title": "Řidička paní Gilmorové",
    "plot": "Logan se vrací z nemocnice domů a stará se o něj příliš starostlivá Rory; Liz má pro Luka velkou novinu; Emily jde na operaci očí LASIK, a tak jí Lorelai musí dělat šoféra; Rory je rozrušená výrokem, který o ní Loganův otec pronesl v rozhovoru pro Wall Street Journal; Jackson zjistí, že bývalí zaměstnanci zasadili na jednom z jeho polí marihuanu, a se Sookie se jí snaží zbavit.",
    "thumb": "https://image.tmdb.org/t/p/w500/v5BI8TO5mmK8RlghOOamRMXmkNJ.jpg"
  },
  "S06E22": {
    "title": "Loučení a rozchody",
    "plot": "Stars Hollow potřebuje nového městského trubadúra a k Taylorově nelibosti se o něj uchází mnoho nadějných lidí. Lorelai konečně konfrontuje Luka s jejich dlouhým zasnoubením a Rory a Logan spolu stráví poslední noc předtím, než musí odjet do Londýna.",
    "thumb": "https://image.tmdb.org/t/p/w500/nA6ViMJZVLvrXFQjACCtct6SSzw.jpg"
  },
  "S07E01": {
    "title": "Dlouhý zítřek",
    "plot": "Lorelai se po rozchodu s Lukem probudí vedle Christophera. Rory dostane od Logana jako dárek na rozloučenou model rakety a snaží se rozluštit jeho význam. Kirk nabourá do Lukova bistra. Luke se snaží získat Lorelai zpět, ale ta mu oznámí, že se vyspala s Christopherem. Christopher zavolá Lorelai a řekne: \"Ta minulá noc byla neuvěřitelná a doufám, že se to může opakovat.\" Lorelai mu odpoví: \"Ta noc byla chyba a už se to nemůže opakovat.\" Christopher jí odpoví: \"Ne, ne, ne, ne, ne, ne.",
    "thumb": "https://image.tmdb.org/t/p/w500/lXwnCMAeE93lMGQCLQQYTfqVsTG.jpg"
  },
  "S07E02": {
    "title": "A to má pak člověk za to",
    "plot": "Luke udeří Christophera poté, co zjistí, že se s ním Lorelai vyspala. Poté, co Lorelai nemůže jet s Loganem na výlet do Asie, uspořádá Rory večírek s asijskou tematikou, ale Rory zjistí, že Lorelai spala s Christopherem, a rozčílí se. Lane a Zach se vracejí z nepříliš vydařených líbánek v Mexiku. Lane oznámí Rory, že sex se přeceňuje; zjištění, že je těhotná, jejímu názoru nepomůže. Luke a Lorelai začínají řešit svůj rozchod.",
    "thumb": "https://image.tmdb.org/t/p/w500/wRFoMXlbuVAvsx2bvcKQWxPUFhF.jpg"
  },
  "S07E03": {
    "title": "Lorelai a její první kotilion",
    "plot": "Lorelai začne přemýšlet, zda všechna rozhodnutí, která učinila, nebyla způsobena její snahou vzbouřit se proti matce. Christopher řekne Lorelai, že ji miluje.",
    "thumb": "https://image.tmdb.org/t/p/w500/4KEAYjYbQUiK2cP5UhA7JkseNj6.jpg"
  },
  "S07E04": {
    "title": "Je to nádherné, je to zázračné",
    "plot": "Lorelai a Chris spolu začnou chodit. Christopher Sherry odpustí poté, co mu pošle omluvný dopis. Rory se vrací na Yale na podzimní semestr posledního ročníku. April dočasně bydlí u Luka, zatímco její matka Anna je mimo město. Richard nastupuje na Yale jako hostující přednášející. Rory píše o výstavě umění pro Yaleovy noviny a seznamuje se s novými kamarádkami Lucy a Olivií.",
    "thumb": "https://image.tmdb.org/t/p/w500/8V5DXoHPOdWb0O1s9J03eMenvXF.jpg"
  },
  "S07E05": {
    "title": "Velký zápach",
    "plot": "Logan se vrací do města, aby získal internetovou společnost, a překvapivě navštíví Roryho. Rory je nadšená, ale během večeře s Loganovými kolegy si uvědomí, že s jeho novým obchodním světem nemá nic společného. Lorelai a Christopher se pohádají kvůli tomu, že Gigi odjede na několik měsíců do Paříže za Sherry. Christopher požádá Lorelai, aby jela do Paříže s ním.",
    "thumb": "https://image.tmdb.org/t/p/w500/aJsousjavEW7CV7XUz9PYTQRgtd.jpg"
  },
  "S07E06": {
    "title": "Buldoci, do toho!",
    "plot": "Lorelai a Chris se zúčastní rodičovského víkendu na Yale, kde najdou Emily a Richarda. Chris vezme Rory a všechny její přátele na večeři poté, co se cítí provinile, že nebyl nablízku, když Rory vyrůstala. Na konci prokáže své odhodlání plnit povinnosti redaktorky novin tím, že shromáždí vojáky, aby podali zprávu o příběhu.",
    "thumb": "https://image.tmdb.org/t/p/w500/5cJ9f2J55o3xJBGtYHnRmyWwwtz.jpg"
  },
  "S07E07": {
    "title": "Manželství po francouzsku",
    "plot": "Lorelai a Chris letí do Francie, aby odvezli Gigi za její matkou Sherry. Jakmile tam Chris požádá Lorelai o ruku, vrátí se do Stars Hollow jako manželé Haydenovi. Radost z Roryina výletu na venkov (do Stars Hollow) s Lucy a Olivií je zkalena Roryiným zhroucením ohledně jejích obav z budoucnosti a nečekaným objevením se kamarádky z minulosti, která se zříká toho, že by Rory znala. Zach a Lane zjistí, že čekají dvojčata, a oznámí paní Kim zprávu o svém nadcházejícím rodičovství, což má nečekané následky.",
    "thumb": "https://image.tmdb.org/t/p/w500/hiUvp5SfDKqutBYnGrb0aGj52FV.jpg"
  },
  "S07E08": {
    "title": "Představuji vám Lorelai planetárium",
    "plot": "Rory se zlobí, že se nemohla zúčastnit svatby Lorelai a Chrise. Logan se stěhuje z Londýna do New Yorku. Pohádá se s Rory kvůli článku, který napsala. U April se objeví zánět slepého střeva a Luke ji odveze do nemocnice.",
    "thumb": "https://image.tmdb.org/t/p/w500/uoz0nAu0e7MSmfGDIqqgWWYSt0v.jpg"
  },
  "S07E09": {
    "title": "Pleťte, lidičky pleťte!",
    "plot": "Chris a Lorelai řeknou Emily a Richardovi o svém manželství. Lorelai je rozhodnuta, že si Christophera lidé ve Stars Hollow oblíbí. Anna oznámí Lukovi, že se stěhuje na druhý konec země a bere April s sebou, načež Luke Anně řekne, že bude bojovat o opatrovnictví. Rory se po odstěhování z Loganova bytu nastěhuje k Paris. Zúčastní se večírku v Lucyině bytě; Marty Rory prozradí, že k ní stále něco cítí. Lukovy zjevné city k Lorelai jsou v jeho chování stále patrné.",
    "thumb": "https://image.tmdb.org/t/p/w500/roeVEp7Ohzn3ySpiZswa78mYQrt.jpg"
  },
  "S07E10": {
    "title": "Na kordy",
    "plot": "Luke a Lorelai prožijí společnou chvíli, když jí Luke představí Lizino nové dítě a Christopher je svědkem této scény. Lorelai a Christopher se pohádají kvůli tomu, co chce Lorelai a co chce Christopher. Luke kontaktuje právníka kvůli problémům s opatrovnictvím Anny. Christopher a Luke se pohádají na náměstí. Logan zjistí, že Rory a Marty předstírali, že se právě poznali, a odhalí Lucy pravdu. Emily dává Lorelai rady ohledně jejího manželství.",
    "thumb": "https://image.tmdb.org/t/p/w500/29kbHmO7NwP23ZJulxFdLg2LRo9.jpg"
  },
  "S07E11": {
    "title": "Vánoční tajnosti",
    "plot": "Luke požádá Lorelai, aby se stala referencí v jeho případu opatrovnictví. Rory se vrací z Londýna z Vánoc s Loganem, kde se s ním usmířila. Gilmorova děvčata slaví Vánoce s měsíčním zpožděním. April se vyplíží za Lukem.",
    "thumb": "https://image.tmdb.org/t/p/w500/xieny1zf03ShbXFoyFYzCJSznf6.jpg"
  },
  "S07E12": {
    "title": "Všem, jichž se to týká",
    "plot": "Rory se usmíří s Lucy, zatímco Christopher najde dopis, který Lorelai napsala Lukovi jako referenci. Rory se na Richardově hodině ekonomie stane svědkem děsivého pohledu. Sookie se chová divně, a tak Lorelai donutí Jacksona k přiznání: Sookie je opět těhotná, přestože Sookie řekla Jacksonovi, aby si nechal udělat vasektomii.",
    "thumb": "https://image.tmdb.org/t/p/w500/7D6pBs14ojteiCGolwHO0Bjfx1r.jpg"
  },
  "S07E13": {
    "title": "Raději bych byl ve Filadelfii",
    "plot": "Richard je v nemocnici s Emily, Lorelai a Rory v čekárně; Logan přijde za Rory. Lorelai volá Christopherovi, aby mu dala vědět, ale nemůže se mu dovolat. Luke se o Richardovi doslechne a přiběhne mu na pomoc.",
    "thumb": "https://image.tmdb.org/t/p/w500/6HKSiuchCruYorHCKTXI4UvpP6P.jpg"
  },
  "S07E14": {
    "title": "Sbohem, můj mazlíčku",
    "plot": "Richard se cítí lépe a chystá se opustit nemocnici. Michelovi umírá pes Chin Chin a Michel přiměje Lorelai, aby uspořádala jeho pohřeb ve Vážce. Rory se zamiluje do asistenta učitele, který zaskakuje za Richarda, a přizná se Loganovi ke svým \"sebedestruktivním\" citům. Lorelai a Christopher ukončí své manželství poté, co jí vyčte, že stále cítí něco k Lukovi.",
    "thumb": "https://image.tmdb.org/t/p/w500/bscJMnFYzKZ6vBlryvhJHxbkmN7.jpg"
  },
  "S07E15": {
    "title": "Jsem kaja, slyšíte, jak se řítím",
    "plot": "Lorelai se Emily těžko svěřuje se svým rozchodem, ale ke svému překvapení se setkává s pochopením, když to udělá. Rory připraví pro Logana \"gilmorské narozeniny\", aby mu ukázala, že narozeniny mohou být zábavné, na rozdíl od způsobu, jakým se slaví v rodině Huntzburgerových. Logan se dozví, že patenty jeho společnosti nejsou platné kvůli předchozímu stavu techniky.",
    "thumb": "https://image.tmdb.org/t/p/w500/a8iXwLsgYNYvxRNbiW1pHH8MtF5.jpg"
  },
  "S07E16": {
    "title": "Buď má Lorelai Gilmorová",
    "plot": "Lorelai a Rory uspořádají Laneinu oslavu, ale Lorelai musí nejprve vyřešit hádku mezi Lane a její matkou. Rory má rozhovor pro New York Times. Luke prodá Kirkovi otcovu loď a koupí si novou a větší. Logan konečně řekne Rory o své obchodní situaci a ona se mu snaží pomoci, i když s tím nemůže nic dělat. Nabídne mu, že se vrátí z Laneiny oslavy narození dítěte dřív, aby mohla být s ním, ale Logan se rozhodne jet do Las Vegas s Colinem a Finnem, aby trochu upustil páru.",
    "thumb": "https://image.tmdb.org/t/p/w500/hBzXTMdeLzPR6gqfqn48gKJ00hZ.jpg"
  },
  "S07E17": {
    "title": "Jen Gilmorova děvčata",
    "plot": "Lorelai plánuje výlet na svatbu Mii, ženy, která dívkám léta sloužila jako náhradní matka/babička. Rory se pohádá s Loganem kvůli jeho nedospělé reakci na jeho obchodní katastrofu a souhlasí, že na výlet pojede s Lorelai. Emily se pozve s sebou ve snaze dostat se pryč od Richarda, který ji dohání k šílenství, zatímco se doma zotavuje. Na svatbě je Emily rozrušená blízkým vztahem, který Mia sdílí s Lorelai a Rory. Lorelai se dozví, že Emily přišla za Miou před pěti lety, aby ji požádala o fotky Lorelai a Rory z let, kdy se odcizily. Logan se nečekaně objeví a požádá Rory, aby mu odpustila. Mezitím Lane a Zack požádají Luka, aby se stal kmotrem jejich dvojčat Steva a Kwana. Nakonec Lane začne rodit a Luke pomůže všechny odvézt do nemocnice.",
    "thumb": "https://image.tmdb.org/t/p/w500/8tcjX3HFgDiG6Etwy3erOc1ea0T.jpg"
  },
  "S07E18": {
    "title": "Bludiště",
    "plot": "Když Taylor utratí celý jarní rozpočet za bludiště z balíků sena, donutí to Lorelai a Luka, aby se v bludišti z balíků sena znovu setkali. Rory a Logan přijíždějí do Stars Hollow na jarní veletrh a Rory se dozvídá, že dostala nabídku na práci v novinách. Když zhodnotí, co skutečně chce, rozhodne se nabídku odmítnout a počkat na stáž v New York Times.",
    "thumb": "https://image.tmdb.org/t/p/w500/l6U1mJm5iSFTQIFe1wCBDe0jwef.jpg"
  },
  "S07E19": {
    "title": "Je to jako jízda na kole",
    "plot": "Lorelai se snaží usmířit s Lukem návštěvou bistra, ale výsledkem setkání je trapné ticho. Paris se vyděsí z příliš mnoha příležitostí, když ji přijmou na poměrně dost postgraduálních programů. Roryiny naděje se rozplynou, když ji odmítnou na stáž v New York Times. Při pobytu u Lorelai Jackson omylem zničí její domeček pro panenky.",
    "thumb": "https://image.tmdb.org/t/p/w500/9FqoYsYtjRV14XtDF0NUMeQdNYS.jpg"
  },
  "S07E20": {
    "title": "Lorelai, Lorelai",
    "plot": "Poté, co se April dostane na vědecký tábor, řekne Lukovi, že s ním nemůže jet v létě na výlet lodí. Zach je požádán, aby jel na turné s jinou kapelou. Opilá Lorelai zahraje Lukovi serenádu na karaoke večeru. Logan získá práci v San Francisku, kde pak jde k Lorelai domů požádat o svolení požádat Rory o ruku a vzít ji s sebou. Šokovaná Lorelai mu neodpoví.",
    "thumb": "https://image.tmdb.org/t/p/w500/1kaSDfnAJrBAZDMx6kA1AMppmIe.jpg"
  },
  "S07E21": {
    "title": "Dokud to neprolomíme",
    "plot": "Na Roryině maturitním večírku v domě jejích prarodičů ji Logan požádá o ruku. Emily a Richard zazpívají Rory maturitní píseň. Rory je zaskočena a říká, že potřebuje čas na rozmyšlenou. Poté, co Rory promuje na Yale, řekne Loganovi, že si ho nemůže vzít. Logan jí řekne, že je to všechno, nebo nic, a Rory se rozhodne odmítnout. Logan jejich vztah ukončí.",
    "thumb": "https://image.tmdb.org/t/p/w500/x5Dye93ej8XFoMwP2J4A4sQMdtW.jpg"
  },
  "S07E22": {
    "title": "Šťastnou cestu",
    "plot": "Rory získá vysněnou práci politické reportérky v Ohiu. Luke požádá o pomoc všechny obyvatele Stars Hollow, aby pro ni uspořádali oslavu ukončení studia a rozloučili se s ní. Lukova ohleduplnost vyvolá u Lorelai dlouho očekávanou reakci.",
    "thumb": "https://image.tmdb.org/t/p/w500/jqkAXlmiPYcS5kyTSJeTHF4n5vP.jpg"
  }
}